TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/*********************************************************************************************************************
 *  COPYRIGHT
 *  ------------------------------------------------------------------------------------------------------------------
 *  \verbatim
 *
 *   TEXAS INSTRUMENTS TEXT FILE LICENSE
 *
 *   Copyright (c) 2025 Texas Instruments Incorporated
 *
 *   All rights reserved not granted herein.
 *
 *   Limited License.
 *
 *   Texas Instruments Incorporated grants a world-wide, royalty-free, non-exclusive
 *   license under copyrights and patents it now or hereafter owns or controls to
 *   make, have made, use, import, offer to sell and sell ("Utilize") this software
 *   subject to the terms herein. With respect to the foregoing patent license,
 *   such license is granted solely to the extent that any such patent is necessary
 *   to Utilize the software alone. The patent license shall not apply to any
 *   combinations which include this software, other than combinations with devices
 *   manufactured by or for TI ("TI Devices"). No hardware patent is licensed hereunder.
 *
 *   Redistributions must preserve existing copyright notices and reproduce this license
 *   (including the above copyright notice and the disclaimer and (if applicable) source
 *   code license limitations below) in the documentation and/or other materials provided
 *   with the distribution.
 *
 *   Redistribution and use in binary form, without modification, are permitted provided
 *   that the following conditions are met:
 *
 *   * No reverse engineering, decompilation, or disassembly of this software is
 *     permitted with respect to any software provided in binary form.
 *   * Any redistribution and use are licensed by TI for use only with TI Devices.
 *   * Nothing shall obligate TI to provide you with source code for the software
 *     licensed and provided to you in object code.
 *
 *   If software source code is provided to you, modification and redistribution of the
 *   source code are permitted provided that the following conditions are met:
 *
 *   * Any redistribution and use of the source code, including any resulting derivative
 *     works, are licensed by TI for use only with TI Devices.
 *   * Any redistribution and use of any object code compiled from the source code
 *     and any resulting derivative works, are licensed by TI for use only with TI Devices.
 *
 *   Neither the name of Texas Instruments Incorporated nor the names of its suppliers
 *   may be used to endorse or promote products derived from this software without
 *   specific prior written permission.
 *
 *   DISCLAIMER.
 *
 *   THIS SOFTWARE IS PROVIDED BY TI AND TI'S LICENSORS "AS IS" AND ANY EXPRESS OR IMPLIED
 *   WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY
 *   AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL TI AND TI'S
 *   LICENSORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 *   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 *   GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 *   CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 *   (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 *   EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *  \endverbatim
 *  ------------------------------------------------------------------------------------------------------------------
 *  FILE DESCRIPTION
 *  ------------------------------------------------------------------------------------------------------------------
 *  File:       Cdd_Pwm_Priv.h
 *  Generator:  None
 *
 *  Description:   This file contains data structures and function declarations of the private APIs.
 *********************************************************************************************************************/
#ifndef CDD_PWM_PRIV_H
#define CDD_PWM_PRIV_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************************************************************************************************************
 * Header Files
 *********************************************************************************************************************/
#include "Cdd_Pwm.h"
#include "hw_epwm.h"
#include "hw_sysctl.h"
#include "hw_types.h"
#include "hw_memmap.h"

#if (STD_ON == CDD_PWM_DEV_ERROR_DETECT)
#include "Det.h"
#endif

/*********************************************************************************************************************
 * Version Check (if required)
 *********************************************************************************************************************/

/*********************************************************************************************************************
 * Exported Preprocessor #define Constants
 *********************************************************************************************************************/

#if (STD_OFF == CDD_PWM_ADVANCED_MODE_API)

#define CDD_PWM_MAX_DUTY_CYCLE (0x8000U)

#else

#define EPWM_O_XCMP  0x0400U
#define EPWM_O_DE    0x0800U
#define EPWM_O_MINDB 0x0C00U

#endif

/*********************************************************************************************************************
 * Exported Preprocessor #define Macros
 *********************************************************************************************************************/
/* Calibration, Period and Counter Registers for SFO functionality */
#define HRPWMCAL_O_HRCAL        0x44U  // HRPWM Calibration Register
#define HRPWMCAL_O_HRPRD        0x46U  // HRPWM Period Register
#define HRPWMCAL_O_HRCNT0       0x48U  // HRPWM Counter 0 Register
#define HRPWMCAL_O_HRCNT1       0x4AU  // HRPWM Counter 1 Register
#define HRPWMCAL_HRPWR_CALSTART 0x4U   // Calibration Start/Stop
#define HRPWMCAL_HRPWR_CNTSEL   0x8U   // Counter Select Bit
#define HRPWMCAL_HRPWR_CALSTS   0x10U  // Calibration Status Bit
#define HRPWMCAL_HRPWR_TESTSEL  0x20U  // Test Mode (Lump Delay) Select Bit
#define HRPWMCAL_HRPWR_CALSEL_S 6U
#define HRPWMCAL_HRPWR_CALSEL_M 0x3C0U  // ePWM Delay Line Selection for Calibration
#define HRPWMCAL_HRCAL_HRCAL_S  0U
#define HRPWMCAL_HRCAL_HRCAL_M  0xFFU  // Delay Line Calibration Value Register.

/*********************************************************************************************************************
 * Exported Type Declarations
 *********************************************************************************************************************/

#if (STD_OFF == CDD_PWM_ADVANCED_MODE_API)

/* Enumeration for interrupt sources*/
typedef enum
{
    /** \brief No event selected*/
    CDD_PWM_ETMIX_TBCTR_NONE = 0x0U,
    /** \brief Time-base counter equal to zero*/
    CDD_PWM_ETMIX_TBCTR_ZERO = 0x1U,
    /** \brief Time-base counter equal to period*/
    CDD_PWM_ETMIX_TBCTR_PERIOD = 0x2U,
    /** \brief Time-base counter equal to CMPA when the timer is incrementing*/
    CDD_PWM_ETMIX_TBCTR_U_CMPA = 0x4U,
    /** \brief Time-base counter equal to CMPA when the timer is decrementing*/
    CDD_PWM_ETMIX_TBCTR_D_CMPA = 0x8U,
    /** \brief Time-base counter equal to CMPB when the timer is incrementing*/
    CDD_PWM_ETMIX_TBCTR_U_CMPB = 0x10U,
    /** \brief Time-base counter equal to CMPB when the timer is decrementing*/
    CDD_PWM_ETMIX_TBCTR_D_CMPB = 0x20U,
    /** \brief Time-base counter equal to CMPC when the timer is incrementing*/
    CDD_PWM_ETMIX_TBCTR_U_CMPC = 0x40U,
    /** \brief Time-base counter equal to CMPC when the timer is decrementing*/
    CDD_PWM_ETMIX_TBCTR_D_CMPC = 0x80U,
    /** \brief Time-base counter equal to CMPD when the timer is incrementing*/
    CDD_PWM_ETMIX_TBCTR_U_CMPD = 0x100U,
    /** \brief Time-base counter equal to CMPD when the timer is decrementing*/
    CDD_PWM_ETMIX_TBCTR_D_CMPD = 0x200U,
    /** \brief Event is based on DCAEVT1*/
    CDD_PWM_ETMIX_DCAEVT1 = 0x400U
} Cdd_Pwm_EvtMixTriggerSourceType;

/* Design: MCAL-33885 */
/** \brief Channel object structure*/
typedef struct Cdd_Pwm_ChannelObjTag
{
    /* Duty cycle of the PWM channel*/
    Cdd_Pwm_DutyCycleType                  dutycycle;
    /* Determines whether any edges are present on the channel output waveform (Duty cycle other than 0% or 100%) */
    boolean                                channel_active;
    /* Defines the notification status of the channel */
    boolean                                channelnotif_enable;
    /* Action qualifier output actions */
    Cdd_Pwm_ActionQualifierOutputType      level1;
    Cdd_Pwm_ActionQualifierOutputType      level2;
    /* Action qualifier output events */
    Cdd_Pwm_ActionQualifierOutputEventType outputevt1;
    Cdd_Pwm_ActionQualifierOutputEventType outputevt2;

#if (STD_ON == CDD_PWM_NOTIFICATION_SUPPORTED)
    /* Event configured for rising event*/
    Cdd_Pwm_EvtMixTriggerSourceType rising_event;
    /* Event configured for falling event*/
    Cdd_Pwm_EvtMixTriggerSourceType falling_event;
    /** \brief Edge notification type*/
    Cdd_Pwm_EdgeNotificationType    edgenotifytype;
#endif
} Cdd_Pwm_ChannelObjType;

