TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Hardware object structure*/
typedef struct Cdd_Pwm_HwUnitObjTag
{
    /** \brief Waveform period of the PWM instance */
    Cdd_Pwm_PeriodType period;
    /* Interrupt event count of the PWM instance */
    uint16             inteventcount;
#if (STD_ON == CDD_PWM_NOTIFICATION_SUPPORTED)
    /* Trip-zone interrupt notification enable */
    uint8 tripzone_notification;
    /* Interrupt notification enable */
    uint8 notification_enable;
#endif
    /* Active channels with TBCTR=ZERO as the interrupt source*/
    uint8 zero_active;
} Cdd_Pwm_HwUnitObjType;

/** \brief Driver object structure*/
typedef struct Cdd_Pwm_DriverObjTag
{
    /** \brief PWM channel object*/
    Cdd_Pwm_ChannelObjType channelobj[CDD_PWM_CHANNEL_COUNT];
    /** \brief PWM channel object*/
    Cdd_Pwm_HwUnitObjType  hwunitobj[CDD_PWM_COUNT];
    /** \brief Array to store the index of the hardware unit*/
    uint8                  instanceindex[(CDD_PWM_INSTANCE_COUNT + 1U)];
} Cdd_Pwm_DriverObjType;

#endif

#if (STD_ON == CDD_PWM_ADVANCED_MODE_API)

/* Design: MCAL-33886 */
/** \brief Hardware object structure*/
typedef struct Cdd_Pwm_HwUnitObjTag
{
#if (STD_ON == CDD_PWM_NOTIFICATION_SUPPORTED)
    boolean notification_enable;
    boolean tripzone_notification;
#endif
} Cdd_Pwm_HwUnitObjType;

/* Design: MCAL-33884 */
/** \brief Driver object structure*/
typedef struct Cdd_Pwm_DriverObjTag
{
    /* Hardware unit object to store the notification status*/
    Cdd_Pwm_HwUnitObjType hwunitobj[CDD_PWM_COUNT];
    /** \brief Array to store the index of the hardware unit*/
    uint8                 instanceindex[(CDD_PWM_INSTANCE_COUNT + 1U)];
} Cdd_Pwm_DriverObjType;
#endif

/*********************************************************************************************************************
 * Exported Object Declarations
 *********************************************************************************************************************/

/*********************************************************************************************************************
 *  Exported Function Prototypes
 *********************************************************************************************************************/

/** \brief Sets the driver object
 *
 * This private function sets the driver object
 *
 * \param[in]  DrvObj Driver object
 * \param[in]  CfgPtr Configuration pointer
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_SetDrvObj(Cdd_Pwm_DriverObjType* DrvObj, const Cdd_Pwm_ConfigType* CfgPtr);

/** \brief Initializes the driver object
 *
 * This private function initializes the driver object parameters
 *
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_DrvObjInit(void);

/** \brief Initializes the Cdd Pwm driver
 *
 * This private function initializes the Cdd Pwm driver.
 *
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_HwUnitInit(void);

#if (STD_OFF == CDD_PWM_ADVANCED_MODE_API)
#if (CDD_PWM_SET_PERIOD_API == STD_ON)
/** \brief Service to set the period of the PWM hardware unit
 *
 * This service sets period for the requested PWM instance.
 *
 * \param[in] InstanceId     Numeric ID of the PWM hardware unit
 * \param[in] Period         Period for the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_UpdatePeriod(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(Cdd_Pwm_PeriodType, AUTOMATIC) Period);
#endif

/** \brief Service to set the duty cycle of the PWM channel
 *
 * This service sets duty cycle of the PWM channel
 *
 * \param[in] ChannelNumber     Numeric ID of the PWM channel
 * \param[in] DutyCycle         Requested duty cycle for the PWM Channel.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_UpdateDutyCycle(VAR(Cdd_Pwm_ChannelType, AUTOMATIC) ChannelNumber,
                        VAR(Cdd_Pwm_DutyCycleType, AUTOMATIC) DutyCycle);

#if (CDD_PWM_SET_OUTPUT_TO_IDLE_API == STD_ON) || (CDD_PWM_DEINIT_API == STD_ON)
/** \brief Service to set the Output of the PWM channel to the configured idle state
 *
 * This service sets the Output of the PWM channel to the configured idle state
 *
 * \param[in] ChannelNumber     Numeric ID of the PWM channel
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_SetIdleOutput(VAR(Cdd_Pwm_ChannelType, AUTOMATIC) ChannelNumber);
#endif

#if (STD_ON == CDD_PWM_NOTIFICATION_SUPPORTED)
/** \brief Service to enable the notification for the channel
 *
 * This service enables notifications for the requested PWM Channel.
 *
 * \param[in] Channel          Numeric ID of the PWM channel
 * \param[in] EdgeNotification Edge notification type for the channel
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_NotificationEnable(VAR(Cdd_Pwm_ChannelType, AUTOMATIC) Channel,
                           VAR(Cdd_Pwm_EdgeNotificationType, AUTOMATIC) EdgeNotification);

/** \brief Service to disable the notification for the channel
 *
 * This service disables notification for the requested PWM Channel.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_NotificationDisable(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);
#endif

