TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
#if (STD_ON == CDD_PWM_DEINIT_API)
/** \brief De-initializes the Pwm driver
 *
 * This private function de-initializes the Pwm driver.
 *
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_HwUnitDeinit(void);
#endif
#endif

/** \brief Sets up the Counter Compare shadow load mode
 *
 * This function enables and sets up the counter compare shadow load mode.
 * Valid values for the variables are:
 *  - CompModule
 *      - CDD_PWM_COUNTER_COMPARE_A - counter compare A.
 *      - CDD_PWM_COUNTER_COMPARE_B - counter compare B.
 *      - CDD_PWM_COUNTER_COMPARE_C - counter compare C.
 *      - CDD_PWM_COUNTER_COMPARE_D - counter compare D.
 *  - LoadMode
 *      - CDD_PWM_COMP_LOAD_ON_CNTR_ZERO - load when counter equals zero
 *      - CDD_PWM_COMP_LOAD_ON_CNTR_PERIOD - load when counter equals period
 *      - CDD_PWM_COMP_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals
 *                                             zero or period
 *      - CDD_PWM_COMP_LOAD_FREEZE  - Freeze shadow to active load
 *      - CDD_PWM_COMP_LOAD_ON_SYNC_CNTR_ZERO - load when counter equals zero
 *      - CDD_PWM_COMP_LOAD_ON_SYNC_CNTR_PERIOD -load when counter equals period
 *      - CDD_PWM_COMP_LOAD_ON_SYNC_CNTR_ZERO_PERIOD - load when counter equals
 *                                                  zero or period
 *      - CDD_PWM_COMP_LOAD_ON_SYNC_ONLY - load on sync only
 *
 * \param[in] Base              Base address of the PWM instance.
 * \param[in] CompModule     Counter compare module.
 * \param[in] LoadMode       Shadow to active load mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetCounterCompareShadowLoadMode(VAR(uint32, AUTOMATIC) Base,
                                            VAR(Cdd_Pwm_CounterCompareModuleType, AUTOMATIC) CompModule,
                                            VAR(Cdd_Pwm_CounterCompareLoadModeType, AUTOMATIC) LoadMode);

/** \brief Set the time base count
 *
 * This function sets the 16 bit counter value of the time base counter.
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] Count          Time base count value.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivSetTimeBaseCounter(VAR(uint32, AUTOMATIC) Base, VAR(uint16, AUTOMATIC) Count);

/** \brief Service to set emulation mode
 *
 * This function sets the emulation behaviours of the time base counter. Valid
 * values for emulationMode are:
 *  - CDD_PWM_EMULATION_STOP_AFTER_NEXT_TB    - Stop after next Time Base counter
 *                                           increment or decrement.
 *  - CDD_PWM_EMULATION_STOP_AFTER_FULL_CYCLE - Stop when counter completes whole
 *                                           cycle.
 *  - CDD_PWM_EMULATION_FREE_RUN               - Free run.
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] EmulationMode   Emulation Mode
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetEmulationMode(VAR(uint32, AUTOMATIC) Base, VAR(Cdd_Pwm_EmulationModeType, AUTOMATIC) EmulationMode);

/** \brief Interrupt service routine
 *
 * This function is called inside the ISR to clear the interrupt flags
 *
 * \param[in]  InstanceId
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_ProcessIsr(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Sets the PWM period count
 *
 * This function sets the period of the PWM count. The value of PeriodCount is
 * the value written to the register. User should map the desired period or
 * frequency of the waveform into the correct PeriodCount.
 * Invoke the function Cdd_Pwm_SelectPeriodLoadEvent() with the appropriate
 * parameter to set the load mode of the Period count. PeriodCount has a
 * maximum valid value of 0xFFFF
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] PeriodCount    Period count value.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivSetTimeBasePeriod(VAR(uint32, AUTOMATIC) Base, VAR(uint16, AUTOMATIC) PeriodCount);

/** \brief Set time base counter mode
 *
 * This function sets up the time base counter mode.
 * Valid values for CounterMode are:
 *  - CDD_PWM_COUNTER_MODE_UP          - Up - count mode.
 *  - CDD_PWM_COUNTER_MODE_DOWN        - Down - count mode.
 *  - CDD_PWM_COUNTER_MODE_UP_DOWN     - Up - down - count mode.
 *  - CDD_PWM_COUNTER_MODE_STOP_FREEZE - Stop - Freeze counter.
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] CounterMode    Time base counter mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetTimeBaseCounterMode(VAR(uint32, AUTOMATIC) Base,
                                   VAR(Cdd_Pwm_TimeBaseCountModeType, AUTOMATIC) CounterMode);

/** \brief Sets the Action Qualifier shadow load mode
 *
 * This function enables and sets the Action Qualifier shadow load mode.
 * Valid values for the variables are:
 *  - OutputChannel
 *      - CDD_PWM_ACTION_QUALIFIER_A - Action Qualifier A.
 *      - CDD_PWM_ACTION_QUALIFIER_B - Action Qualifier B.
 *  - LoadMode
 *      - CDD_PWM_AQ_LOAD_ON_CNTR_ZERO - load when counter equals zero
 *      - CDD_PWM_AQ_LOAD_ON_CNTR_PERIOD - load when counter equals period
 *      - CDD_PWM_AQ_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals
 *                                               zero or period
 *      - CDD_PWM_AQ_LOAD_FREEZE  - Freeze shadow to active load
 *      - CDD_PWM_AQ_LOAD_ON_SYNC_CNTR_ZERO - load on sync or when counter
 *                                          equals zero
 *      - CDD_PWM_AQ_LOAD_ON_SYNC_CNTR_PERIOD - load on sync or when counter
 *                                           equals period
 *      - CDD_PWM_AQ_LOAD_ON_SYNC_CNTR_ZERO_PERIOD - load on sync or when
 *                                               counter equals zero or period
 *      - CDD_PWM_AQ_LOAD_ON_SYNC_ONLY - load on sync only
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] OutputChannel  Action Qualifier module value.
 * \param[in] LoadMode       Shadow to active load mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierShadowLoadMode(VAR(uint32, AUTOMATIC) Base,
                                             VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                             VAR(Cdd_Pwm_ActionQualifierLoadModeType, AUTOMATIC) LoadMode);

