TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets the ePWM interrupt event count.
 *
 * Set interrupt count.
 *
 * \param[in] Base is the base address of the EPWM module.
 * \param[in] EventCount is the ePWM interrupt count value.
 *
 * This function sets the interrupt event count that determines the number of
 * events that have to occur before an interrupt is issued.
 * Maximum value for eventCount is 15.
 *
 * \return None.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetInterruptEventCount(VAR(uint32, AUTOMATIC) Base, VAR(uint16, AUTOMATIC) EventCount);

/** \brief Enable/disable ePWM interrupt
 *
 * This function enables//disables the ePWM interrupt.
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivConfigureInterrupt(VAR(uint32, AUTOMATIC) Base, VAR(boolean, AUTOMATIC) Select);

/** \brief Sets the ePWM interrupt source
 *
 * This function sets the ePWM interrupt source.
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] InterruptSource  ePWM interrupt source with valid values:
 *                             - CDD_PWM_INT_TBCTR_DISABLED       - Time-base counter is disabled
 *                             - CDD_PWM_INT_TBCTR_ZERO           - Time-base counter equal to zero
 *                             - CDD_PWM_INT_TBCTR_PERIOD         - Time-base counter equal to period
 *                             - CDD_PWM_INT_TBCTR_ZERO_OR_PERIOD - Time-base counter equal to zero or period
 *                             - CDD_PWM_INT_TBCTR_ETINTMIX       - Time-base counter based on mixed events (ETINTMIX)
 *                             - CDD_PWM_INT_TBCTR_U_CMP         - Where x is AU,BU,C or D
 *                                                               Time-base counter equal to CMPAU, CMPBU,
 *                                                               CMPC or CMPD (depending the value of x)
 *                                                               when the timer is incrementing
 *                             - CDD_PWM_INT_TBCTR_D_CMP         - Where x is AU,BU,C or D
 *                                                               Time-base counter equal to CMPAU, CMPBU,
 *                                                               CMPC or CMPD (depending the value of x)
 *                                                               when the timer is decrementing
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetInterruptSource(uint32 Base, VAR(Cdd_Pwm_InterruptSourceType, AUTOMATIC) InterruptSource);

/** \brief Clear interrupt flag
 *
 * This function clears the ePWM interrupt flag.
 *
 * \param[in] Base              Base address of the PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivClearEventTriggerInterruptFlag(VAR(uint32, AUTOMATIC) Base);

/** \brief Set the time base clock and the high speed time base clock count pre-scaler
 *
 * This function sets the pre scaler(divider)value for the time base clock
 * counter and the high speed time base clock counter.
 * Valid values for pre-scaler and highSpeedPrescaler are CDD_PWM_CLOCK_DIVIDER_X,
 * where X is 1,2,4,8,16,32,64 or 128.
 * The actual numerical values for these macros represent values 0U,1...7.
 * The equation for the output clock is:
 *   TBCLK = EPWMCLK/(highSpeedPrescaler* pre-scaler)
 *
 * \b Note: EPWMCLK is a scaled version of SYSCLK. At reset EPWMCLK is half
 *          SYSCLK.
 *
 * \param[in] Base              Base address of the PWM instance
 * \param[in] Prescaler           Time base count pre scale value.
 * \param[in] HighSpeedPrescaler  High speed time base count pre scale value.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetClockPrescaler(VAR(uint32, AUTOMATIC) Base, VAR(Cdd_Pwm_ClockDividerType, AUTOMATIC) Prescaler,
                              VAR(Cdd_Pwm_HighSpeedClkDivType, AUTOMATIC) HighSpeedPrescaler);

#if (STD_ON == CDD_PWM_ADVANCED_MODE_API)

/** \brief Trip-zone Interrupt service routine
 *
 * This function is called inside the trip-zone ISR to clear the trip-zone interrupt flags
 *
 * \param[in]  InstanceId
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_ProcessTripZoneIsr(Cdd_Pwm_InstanceType InstanceId);

/** \brief Set interrupt count
 *
 * This function sets the ePWM interrupt count. eventCount is the value of the
 * pre-interrupt value that is to be loaded. The maximum value of eventCount
 * is 15.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] EventCount    The ePWM interrupt count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetInterruptEventCountInitValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(uint16, AUTOMATIC) EventCount);

/** \brief Set count mode after phase shift sync
 *
 * This function sets the time base count to count up or down after a new
 * phase value set by the Cdd_Pwm_SetPhaseShift(). The count direction is
 * determined by the variable mode. Valid inputs for mode are:
 *  - CDD_PWM_COUNT_MODE_UP_AFTER_SYNC      - Count up after sync
 *  - CDD_PWM_COUNT_MODE_DOWN_AFTER_SYNC    - Count down after sync
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Mode           Count mode after sync.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetCountModeAfterSync(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(Cdd_Pwm_SyncCountModeType, AUTOMATIC) Mode);

