TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Force a software sync pulse
 *
 * This function causes a single software initiated sync pulse. Make sure the
 * appropriate mode is selected using Cdd_Pwm_SetupSyncOutputMode() before using
 * this function.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceSyncPulse(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Set up the source for sync-in pulse
 *
 * This function set the sync out pulse mode.
 * Valid values for mode are:
 *  - CDD_PWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM1-16 - sync-in pulse source can be
 *                                              any of the EPWM1-16 sync-out
 *                                              signal
 *  - CDD_PWM_SYNC_IN_PULSE_SRC_SYNCOUT_ECAP1-7 - sync-in pulse source can be
 *                                             selected as any of the ECAP1-16
 *                                             sync-out signal
 *  - CDD_PWM_SYNC_IN_PULSE_SRC_INPUTXBAR_OUT5-6 - sync-in pulse source can be
 *                                              selected as any of the Input
 *                                              xbar out5-6 signal
 *  - CDD_PWM_SYNC_IN_PULSE_SRC_ETHERCAT_SYNC0-1 - sync-in pulse source can be
 *                                              selected as any of the Ethercat
 *                                              sync0-1 signal
 *  - CDD_PWM_SYNC_IN_PULSE_SRC_DISABLE - sync-in pulse is disabled for the
 *                                     CDD_PWM module
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Source         Sync-in pulse source.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetSyncInPulseSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                 VAR(Cdd_Pwm_SyncInPulseSourceType, AUTOMATIC) Source);

/** \brief Enables sync-out pulse source
 *
 * This function enables the sync-out pulse source.
 * Below valid values for param \b Source can be OR'd together to enable
 * multiple sync-out sources:
 * - CDD_PWM_SYNC_OUT_PULSE_ON_SOFTWARE - sync-out pulse is generated by
 *                                     software when Cdd_Pwm_ForceSyncPulse()
 *                                     function is called or by EPWMxSYNCI
 *                                     signal.
 * - CDD_PWM_SYNC_OUT_PULSE_ON_CNTR_ZERO - sync-out pulse is generated when
 *                                      time base counter equals zero.
 * - CDD_PWM_SYNC_OUT_PULSE_ON_CNTR_COMPARE_B - sync-out pulse is generated when
 *                                           time base counter equals compare
 *                                           B value.
 * - CDD_PWM_SYNC_OUT_PULSE_ON_CNTR_COMPARE_C - sync-out pulse is generated when
 *                                           time base counter equals compare
 *                                           C value.
 * - CDD_PWM_SYNC_OUT_PULSE_ON_CNTR_COMPARE_D - sync-out pulse is generated when
 *                                           time base counter equals compare
 *                                           D value.
 * - CDD_PWM_SYNC_OUT_PULSE_ON_DCA_EVT1_SYNC - sync-out pulse is generated by DCA
 *                                          event1 sync signal
 * - CDD_PWM_SYNC_OUT_PULSE_ON_DCB_EVT1_SYNC - sync-out pulse is generated by DCB
 *                                          event1 sync signal
 * - CDD_PWM_SYNC_OUT_PULSE_ON_ALL  - sync-out pulse is generated by all
 *                                 the above sources
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Source         Sync-out pulse source.
 * \param[in] Select         Boolean to enable/disable the source.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureSyncOutPulseSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(Cdd_Pwm_SyncOutPulseSourceType, AUTOMATIC) Source,
                                        VAR(boolean, AUTOMATIC) Select);

/** \brief Set up the one-shot sync-out trigger source
 *
 * This function sets the one-shot sync-out trigger source.
 * Valid values for param \b Trigger are:
 *  - CDD_PWM_OSHT_SYNC_OUT_TRIG_SYNC - Trigger for one-shot sync-out signal is
 *                                    one-shot sync event.
 *  - CDD_PWM_OSHT_SYNC_OUT_TRIG_RELOAD - Trigger for one-shot sync-out signal is
 *                                     one-shot reload event.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Trigger        One-shot sync-out signal trigger source.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetOneShotSyncOutTrigger(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                     VAR(Cdd_Pwm_OneShotSyncOutTriggerType, AUTOMATIC) Trigger);

/** \brief Set PWM period load mode
 *
 * This function sets the load mode for the PWM period. If LoadMode is set to
 * EPWM_PERIOD_SHADOW_LOAD, a write or read to the TBPRD (PWM Period count
 * register) accesses the shadow register. If LoadMode is set to
 * EPWM_PERIOD_DIRECT_LOAD, a write or read to the TBPRD register accesses the
 * register directly.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] LoadMode       PWM period load mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetPeriodLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                              VAR(Cdd_Pwm_PeriodLoadModeType, AUTOMATIC) LoadMode);

/** \brief Enable phase shift load
 *
 * This function enables loading of phase shift when the appropriate sync event occurs.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Select         Boolean to enable/disable phase shift load.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigurePhaseShiftLoad(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Set shadow to active period load on sync mode
 *
 * This function sets up the shadow to active Period register load mode with
 * respect to a sync event. Valid values for ShadowLoadMode are:
 *  - CDD_PWM_SHADOW_LOAD_MODE_COUNTER_ZERO - shadow to active load occurs when
 *                                         time base counter reaches 0.
 *  - CDD_PWM_SHADOW_LOAD_MODE_COUNTER_SYNC - shadow to active load occurs when
 *                                         time base counter reaches 0 and a
 *                                         SYNC occurs.
 *  - CDD_PWM_SHADOW_LOAD_MODE_SYNC         - shadow to active load occurs only
 *                                         when a SYNC occurs.
 *
 * \param[in] InstanceId          Numeric ID of the requested PWM instance
 * \param[in] ShadowLoadMode    Shadow to active load mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectPeriodLoadEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(Cdd_Pwm_PeriodShadowLoadModeType, AUTOMATIC) ShadowLoadMode);

/** \brief Enable one shot sync mode
 *
 * This function enables one shot sync mode.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Select         Boolean to enable/disable one shot sync mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureOneShotSync(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Start one shot sync mode
 *
 * This function propagates a one shot sync pulse.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivStartOneShotSync(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Returns time base counter value
 *
 * This function returns the current value of the time base counter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return Time base counter value
 * \retval uint16 Current value of the time base counter
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetTimeBaseCounterValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Return time base counter maximum status
 *
 * This function returns the status of the time base max counter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return Status of time base counter overflow
 * \retval boolean True if the counter has reached 0xFFFF, false otherwise
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE)
Cdd_Pwm_PrivGetTimeBaseCounterOverflowStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enable/Disable EPWM XLINK
 *
 * This function enables/disables EPWM XLINK for the specified EPWM instance
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureEpwmXLink(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Clear max time base counter event
 *
 * This function clears the max time base counter latch event. The latch event
 * occurs when the time base counter reaches its maximum value of 0xFFFF.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivClearTimeBaseCounterOverflowEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Return external sync signal status
 *
 * This function returns the external sync signal status.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return Status of external sync signal
 * \retval boolean True if an external sync signal event occurred, false otherwise
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE) Cdd_Pwm_PrivGetSyncStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Clear external sync signal event
 *
 * This function clears the external sync signal latch event.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivClearSyncEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Return time base counter direction
 *
 * This function returns the direction of the time base counter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return Counter direction status
 * \retval uint16 CDD_PWM_TIME_BASE_STATUS_COUNT_UP if counting up or
 *                CDD_PWM_TIME_BASE_STATUS_COUNT_DOWN if counting down
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetTimeBaseCounterDirection(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

