TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets the phase shift offset counter value
 *
 * This function sets the 16 bit time-base counter phase of the ePWM relative
 * to the time-base that is supplying the synchronization input signal. Call
 * the EPWM_enablePhaseShiftLoad() function to enable loading of the
 * PhaseCount phase shift value when a sync event occurs.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] PhaseCount     Phase shift count value.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetPhaseShift(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) PhaseCount);

/** \brief Gets the PWM period count
 *
 * This function gets the period of the PWM count.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return The period count value
 * \retval uint16 Current period count value
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetTimeBasePeriod(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Disables counter compare shadow load mode
 *
 * This function disables counter compare shadow load mode.
 * Valid values for the variables are:
 *  - CompModule
 *      - CDD_PWM_COUNTER_COMPARE_A - counter compare A.
 *      - CDD_PWM_COUNTER_COMPARE_B - counter compare B.
 *      - CDD_PWM_COUNTER_COMPARE_C - counter compare C.
 *      - CDD_PWM_COUNTER_COMPARE_D - counter compare D.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] CompModule     Counter compare module.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivDisableCounterCompareShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                VAR(Cdd_Pwm_CounterCompareModuleType, AUTOMATIC) CompModule);

/** \brief Sets counter compare values
 *
 * This function sets the counter compare value for counter compare registers.
 * The maximum value for CompCount is 0xFUFFF.
 * Valid values for CompModule are:
 *   - CDD_PWM_COUNTER_COMPARE_A - counter compare A.
 *   - CDD_PWM_COUNTER_COMPARE_B - counter compare B.
 *   - CDD_PWM_COUNTER_COMPARE_C - counter compare C.
 *   - CDD_PWM_COUNTER_COMPARE_D - counter compare D.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] CompModule     Counter Compare value module.
 * \param[in] CompCount      Counter compare count value.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetCounterCompareValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(Cdd_Pwm_CounterCompareModuleType, AUTOMATIC) CompModule,
                                   VAR(uint16, AUTOMATIC) CompCount);

/** \brief Gets counter compare values
 *
 * This function gets the counter compare value for counter compare registers.
 * Valid values for CompModule are:
 *   - CDD_PWM_COUNTER_COMPARE_A - counter compare A.
 *   - CDD_PWM_COUNTER_COMPARE_B - counter compare B.
 *   - CDD_PWM_COUNTER_COMPARE_C - counter compare C.
 *   - CDD_PWM_COUNTER_COMPARE_D - counter compare D.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] CompModule     Counter Compare value module.
 * \pre None
 * \post None
 * \return The counter compare count value.
 * \retval uint16 Counter compare value
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetCounterCompareValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(Cdd_Pwm_CounterCompareModuleType, AUTOMATIC) CompModule);

/** \brief Returns the counter compare shadow register full status
 *
 * This function returns the counter Compare shadow register full status flag.
 * Valid values for OuputChannel are:
 *   - CDD_PWM_COUNTER_COMPARE_A - counter compare A.
 *   - CDD_PWM_COUNTER_COMPARE_B - counter compare B.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OuputChannel   Counter Compare value module.
 * \pre None
 * \post None
 * \return Shadow register full status
 * \retval TRUE  If the shadow register is full.
 * \retval FALSE If the shadow register is not full.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE)
Cdd_Pwm_PrivGetCounterCompareShadowStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OuputChannel);

/** \brief Enables CMPAHR, CMPBHR register linking
 *
 * This function enables CMPAHR and CMPBHR register linking. CMPBHR assumes
 * the same value as CMPAHR.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Select         Enable/disable selection.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureLinkDutyHR(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/**
 * Action Qualifier module related APIs
 */

/** \brief Disables Action Qualifier shadow load mode
 *
 * This function disables the Action Qualifier shadow load mode.
 * Valid values for the variables are:
 *  - OutputChannel
 *      - CDD_PWM_ACTION_QUALIFIER_A - Action Qualifier A.
 *      - CDD_PWM_ACTION_QUALIFIER_B - Action Qualifier B.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel  Action Qualifier module value.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivDisableActionQualifierShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                 VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel);

/** \brief Sets up Action qualifier trigger source for event T1
 *
 * This function sets up the sources for Action Qualifier event T1.
 * Valid values for Trigger are:
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCA_1       - Digital compare event A 1
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCA_2       - Digital compare event A 2
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCB_1       - Digital compare event B 1
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCB_2       - Digital compare event B 2
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_TZ_1        - Trip zone 1
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_TZ_2        - Trip zone 2
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_TZ_3U        - Trip zone 3U
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_CDD_PWM_SYNCIN - CDD_PWM sync
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DC_EVTFILT  - Digital compare filter event
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Trigger        Sources for Action Qualifier triggers.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierT1TriggerSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                              VAR(Cdd_Pwm_ActionQualifierTriggerSourceType, AUTOMATIC) Trigger);

/** \brief Sets up Action qualifier trigger source for event T2
 *
 * This function sets up the sources for Action Qualifier event T2.
 * Valid values for Trigger are:
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCA_1       - Digital compare event A 1
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCA_2       - Digital compare event A 2
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCB_1       - Digital compare event B 1
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DCB_2       - Digital compare event B 2
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_TZ_1        - Trip zone 1
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_TZ_2        - Trip zone 2
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_TZ_3U        - Trip zone 3U
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_CDD_PWM_SYNCIN - CDD_PWM sync
 *   - CDD_PWM_AQ_TRIGGER_EVENT_TRIG_DC_EVTFILT  - Digital compare filter event
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Trigger        Sources for Action Qualifier triggers.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierT2TriggerSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                              VAR(Cdd_Pwm_ActionQualifierTriggerSourceType, AUTOMATIC) Trigger);

/** \brief Sets up Action qualifier outputs
 *
 * This function sets up the Action Qualifier output on ePWM A or ePWMB,
 * depending on the value of EpwmOutput, to a value specified by Output based
 * on the input events - specified by Event.
 * The following are valid values for the parameters.
 *   - CDD_pwmOutput
 *       - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
 *       - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
 *   - Output
 *       - CDD_PWM_AQ_OUTPUT_NO_CHANGE  - No change in the output pins
 *       - CDD_PWM_AQ_OUTPUT_LOW        - Set output pins to low
 *       - CDD_PWM_AQ_OUTPUT_HIGH       - Set output pins to High
 *       - CDD_PWM_AQ_OUTPUT_TOGGLE     - Toggle the output pins
 *   - Event
 *       - CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_ZERO       - Time base counter equals
 *                                                 zero
 *       - CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_PERIOD     - Time base counter equals
 *                                                 period
 *       - CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPA    - Time base counter up equals
 *                                                 COMPA
 *       - CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPA  - Time base counter down
 *                                                 equals COMPA
 *       - CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_UP_CMPB    - Time base counter up equals
 *                                                 COMPB
 *       - CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_DOWN_CMPB  - Time base counter down
 *                                                 equals COMPB
 *       - CDD_PWM_AQ_OUTPUT_ON_T1_COUNT_UP         - T1 event on count up
 *       - CDD_PWM_AQ_OUTPUT_ON_T1_COUNT_DOWN       - T1 event on count down
 *       - CDD_PWM_AQ_OUTPUT_ON_T2_COUNT_UP         - T2 event on count up
 *       - CDD_PWM_AQ_OUTPUT_ON_T2_COUNT_DOWN       - T2 event on count down
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] EpwmOutput     The ePWM pin type.
 * \param[in] Output         The Action Qualifier output.
 * \param[in] Event          The event that causes a change in output.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                     VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) EpwmOutput,
                                     VAR(Cdd_Pwm_ActionQualifierOutputType, AUTOMATIC) Output,
                                     VAR(Cdd_Pwm_ActionQualifierOutputEventType, AUTOMATIC) Event);

/** \brief Sets up Action qualifier outputs
*

