TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
* This function sets up the Action Qualifier output on ePWMA or ePWMB, depending on the value of EpwmOutput, to a
* value specified by action.
* Valid action param values from different time base counter scenarios should be OR'd together to configure complete
* action for a pwm output.
* The following are valid values for the parameters.
*   - CDD_pwmOutput
*       - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
*       - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
*
*   - action
*       - When time base counter equals zero
*         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_ZERO   - Time base counter equals zero
*                                             and no change in output pins
*         - CDD_PWM_AQ_OUTPUT_LOW_ZERO         - Time base counter equals zero
*                                             and set output pins to low
*         - CDD_PWM_AQ_OUTPUT_HIGH_ZERO        - Time base counter equals zero
*                                             and set output pins to high
*         - CDD_PWM_AQ_OUTPUT_TOGGLE_ZERO      - Time base counter equals zero
*                                             and toggle the output pins
*       - When time base counter equals period
*         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_PERIOD - Time base counter equals period
*                                             and no change in output pins
*         - CDD_PWM_AQ_OUTPUT_LOW_PERIOD       - Time base counter equals period
*                                             and set output pins to low
*         - CDD_PWM_AQ_OUTPUT_HIGH_PERIOD      - Time base counter equals period
*                                             and set output pins to high
*         - CDD_PWM_AQ_OUTPUT_TOGGLE_PERIOD    - Time base counter equals period
*                                             and toggle the output pins
*       - When time base counter equals CMPA during up-count
*         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_UP_CMPA  - Time base counter up equals
*                                               COMPA and no change in the
*                                               output pins
*         - CDD_PWM_AQ_OUTPUT_LOW_UP_CMPA        - Time base counter up equals
*                                               COMPA and set output pins low
*         - CDD_PWM_AQ_OUTPUT_HIGH_UP_CMPA       - Time base counter up equals
*                                               COMPA and set output pins high
*         - CDD_PWM_AQ_OUTPUT_TOGGLE_UP_CMPA     - Time base counter up equals
*                                               COMPA and toggle output pins
*       - When time base counter equals CMPA during down-count
*         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_DOWN_CMPA - Time base counter down equals
*                                                COMPA and no change in the
*                                                output pins
*         - CDD_PWM_AQ_OUTPUT_LOW_DOWN_CMPA      - Time base counter down equals
*                                               COMPA and set output pins low
*         - CDD_PWM_AQ_OUTPUT_HIGH_DOWN_CMPA     - Time base counter down equals
*                                               COMPA and set output pins high
*         - CDD_PWM_AQ_OUTPUT_TOGGLE_DOWN_CMPA   - Time base counter down equals
*                                               COMPA and toggle output pins
*       - When time base counter equals CMPB during up-count
*         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_UP_CMPB  - Time base counter up equals
*                                               COMPB and no change in the
*                                               output pins
*         - CDD_PWM_AQ_OUTPUT_LOW_UP_CMPB        - Time base counter up equals
*                                               COMPB and set output pins low
*         - CDD_PWM_AQ_OUTPUT_HIGH_UP_CMPB       - Time base counter up equals
*                                               COMPB and set output pins high
*         - CDD_PWM_AQ_OUTPUT_TOGGLE_UP_CMPB     - Time base counter up equals
*                                               COMPB and toggle output pins
*       - When time base counter equals CMPB during down-count
*         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_DOWN_CMPB- Time base counter down equals
*                                               COMPB and no change in the
*                                               output pins
*         - CDD_PWM_AQ_OUTPUT_LOW_DOWN_CMPB      - Time base counter down equals
*                                               COMPB and set output pins low
*         - CDD_PWM_AQ_OUTPUT_HIGH_DOWN_CMPB     - Time base counter down equals
*                                               COMPB and set output pins high
*         - CDD_PWM_AQ_OUTPUT_TOGGLE_DOWN_CMPB   - Time base counter down equals
*                                               COMPB and toggle output pins
*
* \param[in] InstanceId     Numeric ID of the requested PWM instance.
* \param[in] OutputChannel  EPWM output channel (OUTPUT A or OUTPUT B).
* \param[in] Action          AQ action
* \pre None
* \post None
* \return None
* \retval None
*
*********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierActionComplete(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                             VAR(uint16, AUTOMATIC) Action);

/** \brief Sets up Additional action qualifier event outputs
 *
 * This function sets up the Additional Action Qualifier output on ePWMA or
 * ePWMB depending on the value of OutputChannel, to a value specified by Action.
 * Valid Action param values from different event scenarios should be OR'd
 * together to configure complete action for a pwm output.
 * The following are valid values for the parameters.
 *   - OutputChannel
 *       - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
 *       - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
 *   - Action
 *       - When T1 event occurs during up-count
 *         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_UP_T1  - T1 event on count up
 *                                             and no change in output pins
 *         - CDD_PWM_AQ_OUTPUT_LOW_UP_T1        - T1 event on count up
 *                                           and set output pins to low
 *         - CDD_PWM_AQ_OUTPUT_HIGH_UP_T1       - T1 event on count up
 *                                           and set output pins to high
 *         - CDD_PWM_AQ_OUTPUT_TOGGLE_UP_T1     - T1 event on count up
 *                                           and toggle the output pins
 *       - When T1 event occurs during down-count
 *         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_DOWN_T1- T1 event on count down
 *                                           and no change in output pins
 *         - CDD_PWM_AQ_OUTPUT_LOW_DOWN_T1      - T1 event on count down
 *                                           and set output pins to low
 *         - CDD_PWM_AQ_OUTPUT_HIGH_DOWN_T1     - T1 event on count down
 *                                           and set output pins to high
 *         - CDD_PWM_AQ_OUTPUT_TOGGLE_DOWN_T1   - T1 event on count down
 *                                           and toggle the output pins
 *       - When T2 event occurs during up-count
 *         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_UP_T2  - T2 event on count up
 *                                             and no change in output pins
 *         - CDD_PWM_AQ_OUTPUT_LOW_UP_T2        - T2 event on count up
 *                                             and set output pins to low
 *         - CDD_PWM_AQ_OUTPUT_HIGH_UP_T2       - T2 event on count up
 *                                             and set output pins to high
 *         - CDD_PWM_AQ_OUTPUT_TOGGLE_UP_T2     - T2 event on count up
 *                                             and toggle the output pins
 *       - When T2 event occurs during down-count
 *         - CDD_PWM_AQ_OUTPUT_NO_CHANGE_DOWN_T2 - T2 event on count down
 *                                              and no change in output pins
 *         - CDD_PWM_AQ_OUTPUT_LOW_DOWN_T2       - T2 event on count down
 *                                              and set output pins to low
 *         - CDD_PWM_AQ_OUTPUT_HIGH_DOWN_T2      - T2 event on count down
 *                                              and set output pins to high
 *         - CDD_PWM_AQ_OUTPUT_TOGGLE_DOWN_T2    - T2 event on count down
 *                                              and toggle the output pins
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel  EPWM output channel (OUTPUT A or OUTPUT B).
 * \param[in] Action         The desired action when the specified event occurs.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 * \note A logical OR of the valid values should be passed as the Action
 *       parameter. Single action should be configured for each event
 *       scenario.
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetAdditionalActionQualifierActionComplete(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                       VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                       VAR(uint16, AUTOMATIC) Action);

