TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets up Action qualifier continuous software load mode
 *
 * This function sets up the AQCFRSC register load mode for continuous
 * software force reload mode. The software force actions are determined by
 * the Cdd_Pwm_SetActionQualifierContSwForceAction() function.
 * Valid values for Mode are:
 *   - CDD_PWM_AQ_SW_SH_LOAD_ON_CNTR_ZERO        - shadow mode load when counter
 *                                               equals zero
 *   - CDD_PWM_AQ_SW_SH_LOAD_ON_CNTR_PERIOD      - shadow mode load when counter
 *                                               equals period
 *   - CDD_PWM_AQ_SW_SH_LOAD_ON_CNTR_ZERO_PERIOD - shadow mode load when counter
 *                                               equals zero or period
 *   - CDD_PWM_AQ_SW_IMMEDIATE_LOAD               - immediate mode load only
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Mode           Mode for shadow to active load mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierContSwForceShadowMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                    VAR(Cdd_Pwm_ActionQualifierContForceType, AUTOMATIC) Mode);

/** \brief Triggers a continuous software forced event
 *
 * This function triggers a continuous software forced Action Qualifier output
 * on ePWM A or B based on the value of OutputChannel.
 * Valid values for the parameters are:
 *   - OutputChannel
 *       - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
 *       - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
 *   - Output
 *       - CDD_PWM_AQ_SW_DISABLED       - Software forcing disabled.
 *       - CDD_PWM_AQ_SW_OUTPUT_LOW     - Set output pins to low
 *       - CDD_PWM_AQ_SW_OUTPUT_HIGH    - Set output pins to High
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel  EPWM output channel (OUTPUT A or OUTPUT B).
 * \param[in] Output         The Action Qualifier output.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierContSwForceAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                VAR(Cdd_Pwm_ActionQualifierSwOutputType, AUTOMATIC) Output);

/** \brief Sets up one time software forced Action qualifier outputs
 *
 * This function sets up the one time software forced Action Qualifier output
 * on ePWM A or ePWMB, depending on the value of OutputChannel to a value
 * specified by Output.
 * The following are valid values for the parameters.
 *   - OutputChannel
 *       - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
 *       - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
 *   - Output
 *       - CDD_PWM_AQ_OUTPUT_NO_CHANGE  - No change in the output pins
 *       - CDD_PWM_AQ_OUTPUT_LOW        - Set output pins to low
 *       - CDD_PWM_AQ_OUTPUT_HIGH       - Set output pins to High
 *       - CDD_PWM_AQ_OUTPUT_TOGGLE     - Toggle the output pins
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel  EPWM output channel (OUTPUT A or OUTPUT B).
 * \param[in] Output         The Action Qualifier output.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetActionQualifierSwAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                       VAR(Cdd_Pwm_ActionQualifierOutputType, AUTOMATIC) Output);

/** \brief Triggers a one time software forced event on Action qualifier
 *
 * This function triggers a one time software forced Action Qualifier event
 * on ePWM A or B based on the value of OutputChannel.
 * Valid values for OutputChannel are:
 *   - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
 *   - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel  EPWM output channel (OUTPUT A or OUTPUT B).
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivForceActionQualifierSwAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel);

/*
 * Dead Band Module related APIs
 */

/** \brief Sets Dead Band signal output swap mode
 *
 * This function sets up the output signal swap mode. For example if the
 * output variable is set to CDD_PWM_DB_OUTPUT_A and enableSwapMode is true, then
 * the ePWM A output gets its signal from the ePWM B signal path.
 *
 * \param[in] InstanceId       Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel    The ePWM Dead Band output.
 * \param[in] EnableSwapMode   The output swap mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDeadBandOutputSwapMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                      VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                      VAR(boolean, AUTOMATIC) EnableSwapMode);

/** \brief Sets Dead Band signal output mode
 *
 * This function sets up the dead band delay mode. The delayMode variable
 * determines if the applied delay is Rising Edge or Falling Edge. The
 * enableDelayMode determines if a dead band delay should be applied.
 * Valid values for the variables are:
 *  - delayMode
 *      - CDD_PWM_DB_RED   - Rising Edge delay
 *      - CDD_PWM_DB_FED   - Falling Edge delay
 *  - enableDelayMode
 *      - true     - Falling edge or Rising edge delay is applied.
 *      - false    - Dead Band delay is bypassed.
 *
 * \param[in] InstanceId       Numeric ID of the requested PWM instance.
 * \param[in] DelayMode        The Dead Band delay type.
 * \param[in] EnableDelayMode  The dead band delay mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDeadBandDelayMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                 VAR(Cdd_Pwm_DeadBandDelayModeType, AUTOMATIC) DelayMode,
                                 VAR(boolean, AUTOMATIC) EnableDelayMode);

