TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets Dead Band delay polarity
 *
 * This function sets up the polarity as determined by the variable polarity
 * of the Falling Edge or Rising Edge delay depending on the value of
 * delayMode. Valid values for the variables are:
 *   - delayMode
 *       - CDD_PWM_DB_RED   - Rising Edge delay
 *       - CDD_PWM_DB_FED   - Falling Edge delay
 *   - polarity
 *       - CDD_PWM_DB_POLARITY_ACTIVE_HIGH   - polarity is not inverted.
 *       - CDD_PWM_DB_POLARITY_ACTIVE_LOW    - polarity is inverted.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] DelayMode      The Dead Band delay type.
 * \param[in] Polarity       The polarity of the delayed signal.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDeadBandDelayPolarity(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                     VAR(Cdd_Pwm_DeadBandDelayModeType, AUTOMATIC) DelayMode,
                                     VAR(Cdd_Pwm_DeadBandPolarityType, AUTOMATIC) Polarity);

/** \brief Sets Rising Edge Dead Band delay input
 *
 * This function sets up the rising Edge delay input signal.
 * Valid values for input are:
 *     - CDD_PWM_DB_INPUT_EPWMA   - Input signal is ePWMA( Valid for both Falling
 *                                  Edge and Rising Edge)
 *     - CDD_PWM_DB_INPUT_EPWMB   - Input signal is ePWMB( Valid for both Falling
 *                                  Edge and Rising Edge)
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] OutputChannel  The input signal to the dead band.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetRisingEdgeDeadBandDelayInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel);

/** \brief Sets Dead Band delay input
 *
 * This function sets up the rising Edge delay input signal.
 * Valid values for input are:
 *   - CDD_PWM_DB_INPUT_EPWMA   - Input signal is ePWMA(Valid for both Falling
 *                                Edge and Rising Edge)
 *   - CDD_PWM_DB_INPUT_EPWMB   - Input signal is ePWMB(Valid for both Falling
 *                                Edge and Rising Edge)
 *   - CDD_PWM_DB_INPUT_DB_RED  - Input signal is the output of Rising
 *                                Edge delay.
 *                               (Valid only for Falling Edge delay)
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Input          The input signal to the dead band.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetFallingEdgeDeadBandDelayInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_DeadBandDelayInputType, AUTOMATIC) Input);

/** \brief Set the Dead Band control shadow load mode
 *
 * This function enables and sets the Dead Band control register shadow
 * load mode.
 * Valid values for the \e loadMode parameter are:
 *     - CDD_PWM_DB_LOAD_ON_CNTR_ZERO         - load when counter equals zero.
 *     - CDD_PWM_DB_LOAD_ON_CNTR_PERIOD       - load when counter equals period.
 *     - CDD_PWM_DB_LOAD_ON_CNTR_ZERO_PERIOD  - load when counter equals zero or
 *                                            period.
 *     - CDD_PWM_DB_LOAD_FREEZE                - Freeze shadow to active load.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] LoadMode       The shadow to active load mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDeadBandControlShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_DeadBandControlLoadModeType, AUTOMATIC) LoadMode);

/** \brief Disable Dead Band control shadow load mode
 *
 * This function disables the Dead Band control register shadow
 * load mode.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivDisableDeadBandControlShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Set the RED (Rising Edge Delay) shadow load mode
 *
 * This function sets the Rising Edge Delay register shadow load mode.
 * Valid values for the \e loadMode parameter are:
 *     - CDD_PWM_DELAY_LOAD_ON_CNTR_ZERO        - load when counter equals zero.
 *     - CDD_PWM_DELAY_LOAD_ON_CNTR_PERIOD      - load when counter equals period.
 *     - CDD_PWM_DELAY_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals zero or
 *                                           period.
 *     - CDD_PWM_DELAY_LOAD_FREEZE               - Freeze shadow to active load.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] LoadMode       The shadow to active load event.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetRisingEdgeDelayCountShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                  VAR(Cdd_Pwm_DeadBandDelayLoadModeType, AUTOMATIC) LoadMode);

/** \brief Disable the RED (Rising Edge Delay) shadow load mode.
 *
 * This function disables the Rising Edge Delay register shadow load mode.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivDisableRisingEdgeDelayCountShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Disable the RED (Rising Edge Delay) shadow load mode
 *
 * This function disables the Rising Edge Delay register shadow load mode.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_DisableRisingEdgeDelayCountShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Set the FED (Falling Edge Delay) shadow load mode
 *
 * This function enables and sets the Falling Edge Delay register shadow load
 * mode. Valid values for the \e loadMode parameters are:
 *     - CDD_PWM_DELAY_LOAD_ON_CNTR_ZERO        - load when counter equals zero.
 *     - CDD_PWM_DELAY_LOAD_ON_CNTR_PERIOD      - load when counter equals period.
 *     - CDD_PWM_DELAY_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals zero or
 *                                            period.
 *     - CDD_PWM_DELAY_LOAD_FREEZE               - Freeze shadow to active load.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] LoadMode       The shadow to active load event.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetFallingEdgeDelayCountShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                   VAR(Cdd_Pwm_DeadBandDelayLoadModeType, AUTOMATIC) LoadMode);

