TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Disables the FED (Falling Edge Delay) shadow load mode
 *
 * This function disables the Falling Edge Delay register shadow load mode.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivDisableFallingEdgeDelayCountShadowLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Sets Dead Band Counter clock rate
 *
 * This function sets up the Dead Band counter clock rate with respect to
 * TBCLK (ePWM time base counter).
 * Valid values for clockMode are:
 *   - CDD_PWM_DB_COUNTER_CLOCK_FULL_CYCLE  -Dead band counter runs at TBCLK
 *                                           (ePWM Time Base Counter) rate.
 *   - CDD_PWM_DB_COUNTER_CLOCK_HALF_CYCLE  -Dead band counter runs at 2*TBCLK
 *                                         (twice ePWM Time Base Counter)rate.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] ClockMode      The Dead Band counter clock mode.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDeadBandCounterClock(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                    VAR(Cdd_Pwm_DeadBandClockModeType, AUTOMATIC) ClockMode);

/** \brief Set ePWM RED count
 *
 * This function sets the RED (Rising Edge Delay) count value.
 * The value of redCount should be less than 0x4000U.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] RedCount       The RED(Rising Edge Delay) count.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetRisingEdgeDelayCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) RedCount);

/** \brief Set ePWM FED count
 *
 * This function sets the FED (Falling Edge Delay) count value.
 * The value of fedCount should be less than 0x4000U.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] FedCount       The FED(Falling Edge Delay) count.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetFallingEdgeDelayCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) FedCount);

/*
 * Chopper module related APIs
 */

/** \brief Enable chopper mode
 *
 * This function enables ePWM chopper module.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Select         Enable/disable selection for chopper.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureChopper(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Set chopper duty cycle
 *
 * This function sets the chopping clock duty cycle. The value of
 * dutyCycleCount should be less than 7. The dutyCycleCount value is converted
 * to the actual chopper duty cycle value base on the following equation:
 *   chopper duty cycle = (dutyCycleCount + 1) / 8
 *
 * \param[in] InstanceId       Numeric ID of the requested PWM instance.
 * \param[in] DutyCycleCount   The chopping clock duty cycle count.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetChopperDutyCycle(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) DutyCycleCount);

/** \brief Set chopper clock frequency scaler
 *
 * This function sets the scaler for the chopping clock frequency. The value
 * of freqDiv should be less than 8. The chopping clock frequency is altered
 * based on the following equation.
 *   chopper clock frequency = SYSCLKOUT / ( 1 + freqDiv)
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] FreqDiv        The chopping clock frequency divider.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetChopperFreq(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) FreqDiv);

/** \brief Set chopper first pulse width
 *
 * This function sets the first pulse width of chopper output waveform. The
 * value of firstPulseWidth should be less than 0x10U. The value of the first
 * pulse width in seconds is given using the following equation:
 *     first pulse width = 1 / (((firstPulseWidth + 1)* SYSCLKOUT)/8)
 *
 * \param[in] InstanceId        Numeric ID of the requested PWM instance.
 * \param[in] FirstPulseWidth   The width of the first pulse.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetChopperFirstPulseWidth(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                      VAR(uint16, AUTOMATIC) FirstPulseWidth);

/*
 * Trip Zone module related APIs
 */

/** \brief Enables Trip Zone signal
 *
 * This function enables the Trip Zone signals specified by tzSignal as a
 * source for the Trip Zone module.
 * Valid values for tzSignal are:
 *   - CDD_PWM_TZ_SIGNAL_CBC1       - TZ1 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_CBC2       - TZ2 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_CBC3U       - TZ3U Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_CBC4       - TZ4 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_CBC5       - TZ5 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_CBC6       - TZ6 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_DCAEVT2    - DCAEVT2 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_DCBEVT2    - DCBEVT2 Cycle By Cycle
 *   - CDD_PWM_TZ_SIGNAL_OSHT1      - One-shot TZ1
 *   - CDD_PWM_TZ_SIGNAL_OSHT2      - One-shot TZ2
 *   - CDD_PWM_TZ_SIGNAL_OSHT3U      - One-shot TZ3U
 *   - CDD_PWM_TZ_SIGNAL_OSHT4      - One-shot TZ4
 *   - CDD_PWM_TZ_SIGNAL_OSHT5      - One-shot TZ5
 *   - CDD_PWM_TZ_SIGNAL_OSHT6      - One-shot TZ6
 *   - CDD_PWM_TZ_SIGNAL_DCAEVT1    - One-shot DCAEVT1
 *   - CDD_PWM_TZ_SIGNAL_DCBEVT1    - One-shot DCBEVT1
 *
 * \note A logical OR of the valid values can be passed as the tzSignal parameter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] TzSignal       The Trip Zone signal.
 * \param[in] Select         Enable/disable selection for the signal.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureTripZoneSignals(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) TzSignal,
                                     VAR(boolean, AUTOMATIC) Select);

/** \brief Enables Trip Zone 2 signal (TZSEL2)
 *
 * This function enables the Trip Zone signals specified by tzSignal as a source for the Trip Zone module.
 * Valid values for tzSignal are:
 *   - CDD_PWM_TZ_SIGNAL_CAPEVT_CBC       - One-shot CAPEVT
 *   - CDD_PWM_TZ_SIGNAL_CAPEVT_OST       - Cycle By Cycle CAPEVT
 *
 * \note A logical OR of the valid values can be passed as the tzSignal parameter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] TzSignal       The Trip Zone signal.
 * \param[in] Select         Enable/disable selection for the signal.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureTripZone2Signals(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) TzSignal,
                                      VAR(boolean, AUTOMATIC) Select);

