TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Set Digital compare conditions that cause Trip Zone event
 *
 * This function sets up the Digital Compare output Trip Zone event sources.
 * The dcType variable specifies the event source to be whether Digital
 * Compare output A or Digital Compare output B. The dcEvent parameter
 * specifies the event that causes Trip Zone.
 * Valid values for the parameters are:
 *  - dcType
 *      - CDD_PWM_TZ_DC_OUTPUT_A1     - Digital Compare output 1 A
 *      - CDD_PWM_TZ_DC_OUTPUT_A2     - Digital Compare output 2 A
 *      - CDD_PWM_TZ_DC_OUTPUT_B1     - Digital Compare output 1 B
 *      - CDD_PWM_TZ_DC_OUTPUT_B2     - Digital Compare output 2 B
 *  - dcEvent
 *      - CDD_PWM_TZ_EVENT_DC_DISABLED         - Event Trigger is disabled
 *      - CDD_PWM_TZ_EVENT_DCXH_LOW            - Trigger event when DCxH low
 *      - CDD_PWM_TZ_EVENT_DCXH_HIGH           - Trigger event when DCxH high
 *      - CDD_PWM_TZ_EVENT_DCXL_LOW            - Trigger event when DCxL low
 *      - CDD_PWM_TZ_EVENT_DCXL_HIGH           - Trigger event when DCxL high
 *      - CDD_PWM_TZ_EVENT_DCXL_HIGH_DCXH_LOW  - Trigger event when DCxL high
 *                                            DCxH low
 *
 * \note x in DCxH/DCxL represents DCAH/DCAL or DCBH/DCBL
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] DcType         Digital compare output type.
 * \param[in] DcEvent        Digital Compare output event.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetTripZoneDigitalCompareEventCondition(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                    VAR(Cdd_Pwm_TripZoneDigitalCompareOutputType, AUTOMATIC) DcType,
                                                    VAR(Cdd_Pwm_TripZoneDigitalCompareOutputEventType, AUTOMATIC)
                                                        DcEvent);

/** \brief Enable advanced Trip Zone event Action
 *
 * This function enables the advanced actions of the Trip Zone events. The
 * advanced features combine the trip zone events with the direction of the
 * counter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] Select         Enable/disable selection for advanced trip zone action.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureTripZoneAdvAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Set Trip Zone Action
 *
 * This function sets the Trip Zone Action to be taken when a Trip Zone event
 * occurs.
 * Valid values for the parameters are:
 *  - tzEvent
 *      - CDD_PWM_TZ_ACTION_EVENT_DCBEVT2  - DCBEVT2 (Digital Compare B event 2)
 *      - CDD_PWM_TZ_ACTION_EVENT_DCBEVT1  - DCBEVT1 (Digital Compare B event 1)
 *      - CDD_PWM_TZ_ACTION_EVENT_DCAEVT2  - DCAEVT2 (Digital Compare A event 2)
 *      - CDD_PWM_TZ_ACTION_EVENT_DCAEVT1  - DCAEVT1 (Digital Compare A event 1)
 *      - CDD_PWM_TZ_ACTION_EVENT_TZB      - TZ1 - TZ6U, DCBEVT2U, DCBEVT1
 *      - CDD_PWM_TZ_ACTION_EVENT_TZA      - TZ1 - TZ6U, DCAEVT2U, DCAEVT1
 *  - tzAction
 *      - CDD_PWM_TZ_ACTION_HIGH_Z         - high impedance output
 *      - CDD_PWM_TZ_ACTION_HIGH           - high output
 *      - CDD_PWM_TZ_ACTION_LOW            - low low
 *      - CDD_PWM_TZ_ACTION_DISABLE        - disable action
 *
 * \note Disable the advanced Trip Zone event using
 *       Cdd_Pwm_DisableTripZoneAdvAction() before calling this function.
 * \note This function operates on both ePWMA and ePWMB depending on the
 *       tzEvent parameter.
 *
 * \param[in] InstanceId     Numeric ID of the requested PWM instance.
 * \param[in] TzEvent        The Trip Zone event type.
 * \param[in] TzAction       The Trip zone Action.
 * \pre None
 * \post None
 * \return None
 * \retval None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetTripZoneAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                              VAR(Cdd_Pwm_TripZoneActionEventType, AUTOMATIC) TzEvent,
                              VAR(Cdd_Pwm_TripZoneActionType, AUTOMATIC) TzAction);

/** \brief Set Advanced Trip Zone Action
 *
 * This function sets the Advanced Trip Zone Action to be taken when an
 * advanced Trip Zone event occurs.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzAdvEvent    Trip Zone event type with valid values:
 *                          - CDD_PWM_TZ_ADV_ACTION_EVENT_TZB_D  - TZ1 - TZ6U, DCBEVT2U, DCBEVT1 while counting down
 *                          - CDD_PWM_TZ_ADV_ACTION_EVENT_TZB_U  - TZ1 - TZ6U, DCBEVT2U, DCBEVT1 while counting up
 *                          - CDD_PWM_TZ_ADV_ACTION_EVENT_TZA_D  - TZ1 - TZ6U, DCAEVT2U, DCAEVT1 while counting down
 *                          - CDD_PWM_TZ_ADV_ACTION_EVENT_TZA_U  - TZ1 - TZ6U, DCAEVT2U, DCAEVT1 while counting up
 * \param[in] TzAdvAction   Trip zone Action with valid values:
 *                          - CDD_PWM_TZ_ADV_ACTION_HIGH_Z    - high impedance output
 *                          - CDD_PWM_TZ_ADV_ACTION_HIGH      - high voltage state
 *                          - CDD_PWM_TZ_ADV_ACTION_LOW       - low voltage state
 *                          - CDD_PWM_TZ_ADV_ACTION_TOGGLE    - Toggle output
 *                          - CDD_PWM_TZ_ADV_ACTION_DISABLE   - disable action
 * \pre None
 * \post None
 * \note This function enables the advanced Trip Zone event.
 * \note This function operates on both ePWMA and ePWMB depending on the TzAdvEvent parameter.
 * \note Advanced Trip Zone events take into consideration the direction of the counter in addition to Trip Zone events.
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetTripZoneAdvAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                 VAR(Cdd_Pwm_TripZoneAdvancedEventType, AUTOMATIC) TzAdvEvent,
                                 VAR(Cdd_Pwm_TripZoneAdvancedActionType, AUTOMATIC) TzAdvAction);

/** \brief Set Advanced Digital Compare Trip Zone Action on ePWMA
*
* This function sets the Digital Compare (DC) Advanced Trip Zone Action to be
* taken on ePWMA when an advanced Digital Compare Trip Zone A event occurs.
*
* \param[in] InstanceId    Numeric ID of the requested PWM instance
* \param[in] OutputChannel  The ePWM output channel
* \param[in] TzAdvDCEvent   Digital Compare Trip Zone event type with valid values:
*                           - CDD_PWM_TZ_ADV_ACTION_EVENT_DCXEVT2_D  - Digital Compare event A2 while counting down
*                           - CDD_PWM_TZ_ADV_ACTION_EVENT_DCXEVT2_U  - Digital Compare event A2 while counting up
*                           - CDD_PWM_TZ_ADV_ACTION_EVENT_DCXEVT1_D  - Digital Compare event A1 while counting down
*                           - CDD_PWM_TZ_ADV_ACTION_EVENT_DCXEVT1_U  - Digital Compare event A1 while counting up
* \param[in] TzAdvDCAction  Digital Compare Trip zone Action with valid values:
*                           - CDD_PWM_TZ_ADV_ACTION_HIGH_Z    - high impedance output
*                           - CDD_PWM_TZ_ADV_ACTION_HIGH      - high voltage state
*                           - CDD_PWM_TZ_ADV_ACTION_LOW       - low voltage state
*                           - CDD_PWM_TZ_ADV_ACTION_TOGGLE    - Toggle output
*                           - CDD_PWM_TZ_ADV_ACTION_DISABLE   - disable action
* \pre None
* \post None
* \note This function enables the advanced Trip Zone event.
* \note Advanced Trip Zone events take into consideration the direction of the counter in addition
        to Digital Compare Trip Zone events.
* \return None
*
*********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetTripZoneAdvDigitalCompareAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                               VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                               VAR(Cdd_Pwm_TripZoneAdvDigitalCompareEventType, AUTOMATIC) TzAdvDCEvent,
                                               VAR(Cdd_Pwm_TripZoneAdvancedActionType, AUTOMATIC) TzAdvDCAction);

/** \brief Enable Trip Zone interrupts
 *
 * This function enables the Trip Zone interrupts.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzInterrupt   Trip Zone interrupt with valid values:
 *                          - CDD_PWM_TZ_INTERRUPT_CBC     - Trip Zones Cycle By Cycle interrupt
 *                          - CDD_PWM_TZ_INTERRUPT_OST     - Trip Zones One Shot interrupt
 *                          - CDD_PWM_TZ_INTERRUPT_DCAEVT1 - Digital Compare A Event 1 interrupt
 *                          - CDD_PWM_TZ_INTERRUPT_DCAEVT2 - Digital Compare A Event 2 interrupt
 *                          - CDD_PWM_TZ_INTERRUPT_DCBEVT1 - Digital Compare B Event 1 interrupt
 *                          - CDD_PWM_TZ_INTERRUPT_DCBEVT2 - Digital Compare B Event 2 interrupt
 *                          - CDD_PWM_TZ_INTERRUPT_CAPEVT  - Trip Zones Capture Event interrupt
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \note A logical OR of the valid values can be passed as the TzInterrupt parameter.
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureTripZoneInterrupt(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(uint16, AUTOMATIC) TzInterrupt, VAR(boolean, AUTOMATIC) Select);

/** \brief Gets the Trip Zone status flag
 *
 * This function returns the Trip Zone status flag.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return The function returns the following or the bitwise OR value of the following values:
 *         - CDD_PWM_TZ_INTERRUPT    - Trip Zone interrupt was generated due to the following TZ events
 *         - CDD_PWM_TZ_FLAG_CBC     - Trip Zones Cycle By Cycle event status flag
 *         - CDD_PWM_TZ_FLAG_OST     - Trip Zones One Shot event status flag
 *         - CDD_PWM_TZ_FLAG_DCAEVT1 - Digital Compare A Event 1 status flag
 *         - CDD_PWM_TZ_FLAG_DCAEVT2 - Digital Compare A Event 2 status flag
 *         - CDD_PWM_TZ_FLAG_DCBEVT1 - Digital Compare B Event 1 status flag
 *         - CDD_PWM_TZ_FLAG_DCBEVT2 - Digital Compare B Event 2 status flag
 *         - CDD_PWM_TZ_FLAG_CAPEVT  - Trip Zones Capture Event flag
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetTripZoneFlagStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

