TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Gets the Trip Zone Cycle by Cycle flag status
 *
 * This function returns the specific Cycle by Cycle Trip Zone flag status.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return The function returns the following values:
 *         - CDD_PWM_TZ_CBC_FLAG_1       - CBC 1 status flag
 *         - CDD_PWM_TZ_CBC_FLAG_2       - CBC 2 status flag
 *         - CDD_PWM_TZ_CBC_FLAG_3U      - CBC 3U status flag
 *         - CDD_PWM_TZ_CBC_FLAG_4       - CBC 4 status flag
 *         - CDD_PWM_TZ_CBC_FLAG_5       - CBC 5 status flag
 *         - CDD_PWM_TZ_CBC_FLAG_6       - CBC 6 status flag
 *         - CDD_PWM_TZ_CBC_FLAG_DCAEVT2 - CBC status flag for Digital compare event A2
 *         - CDD_PWM_TZ_CBC_FLAG_DCBEVT2 - CBC status flag for Digital compare event B2
 *         - CDD_PWM_TZ_CBC_FLAG_CAPEVT  - CBC status flag for capture event
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetCycleByCycleTripZoneFlagStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Gets the Trip Zone One Shot flag status
 *
 * This function returns the specific One Shot Trip Zone flag status.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return The function returns the bitwise OR of the following flags:
 *         - CDD_PWM_TZ_OST_FLAG_OST1     - OST status flag for OST1
 *         - CDD_PWM_TZ_OST_FLAG_OST2     - OST status flag for OST2
 *         - CDD_PWM_TZ_OST_FLAG_OST3U    - OST status flag for OST3U
 *         - CDD_PWM_TZ_OST_FLAG_OST4     - OST status flag for OST4
 *         - CDD_PWM_TZ_OST_FLAG_OST5     - OST status flag for OST5
 *         - CDD_PWM_TZ_OST_FLAG_OST6     - OST status flag for OST6
 *         - CDD_PWM_TZ_OST_FLAG_DCAEVT1  - OST status flag for Digital compare event A1
 *         - CDD_PWM_TZ_OST_FLAG_DCBEVT1  - OST status flag for Digital compare event B1
 *         - CDD_PWM_TZ_OST_FLAG_CAPEVT   - OST status flag for capture event
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetOneShotTripZoneFlagStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Set the Trip Zone CBC pulse clear event
*
* This function set the event which automatically clears the CBC (Cycle by Cycle) latch.
*
* \param[in] InstanceId    Numeric ID of the requested PWM instance
* \param[in] ClearEvent    CBC trip zone clear event with valid values:
*                          - CDD_PWM_TZ_CBC_PULSE_CLR_CNTR_ZERO         - Clear CBC pulse when counter equals zero
*                          - CDD_PWM_TZ_CBC_PULSE_CLR_CNTR_PERIOD       - Clear CBC pulse when counter equals period
*                          - CDD_PWM_TZ_CBC_PULSE_CLR_CNTR_ZERO_PERIOD  -
                                                                    Clear CBC pulse when counter equals zero or period
* \pre None
* \post None
* \return None
*
*********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectCycleByCycleTripZoneClearEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                 VAR(Cdd_Pwm_CbcTripZoneClearModeType, AUTOMATIC) ClearEvent);

/** \brief Clear Trip Zone flag
 *
 * This function clears the Trip Zone flags.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzFlags       Trip Zone flags with valid values:
 *                          - CDD_PWM_TZ_INTERRUPT    - Global Trip Zone interrupt flag
 *                          - CDD_PWM_TZ_FLAG_CBC     - Trip Zones Cycle By Cycle flag
 *                          - CDD_PWM_TZ_FLAG_OST     - Trip Zones One Shot flag
 *                          - CDD_PWM_TZ_FLAG_DCAEVT1 - Digital Compare A Event 1 flag
 *                          - CDD_PWM_TZ_FLAG_DCAEVT2 - Digital Compare A Event 2 flag
 *                          - CDD_PWM_TZ_FLAG_DCBEVT1 - Digital Compare B Event 1 flag
 *                          - CDD_PWM_TZ_FLAG_DCBEVT2 - Digital Compare B Event 2 flag
 *                          - CDD_PWM_TZ_FLAG_CAPEVT  - Trip Zones Capture Event flag
 * \pre None
 * \post None
 * \note A bitwise OR of the valid values can be passed as the TzFlags parameter.
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivClearTripZoneFlag(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) TzFlags);

/** \brief Clear the Trip Zone Cycle by Cycle flag
 *
 * This function clears the specific Cycle by Cycle Trip Zone flag.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzCbcFlags    CBC flag to be cleared with valid values:
 *                          - CDD_PWM_TZ_CBC_FLAG_1       - CBC 1 flag
 *                          - CDD_PWM_TZ_CBC_FLAG_2       - CBC 2 flag
 *                          - CDD_PWM_TZ_CBC_FLAG_3U      - CBC 3U flag
 *                          - CDD_PWM_TZ_CBC_FLAG_4       - CBC 4 flag
 *                          - CDD_PWM_TZ_CBC_FLAG_5       - CBC 5 flag
 *                          - CDD_PWM_TZ_CBC_FLAG_6       - CBC 6 flag
 *                          - CDD_PWM_TZ_CBC_FLAG_DCAEVT2 - CBC flag Digital compare event A2
 *                          - CDD_PWM_TZ_CBC_FLAG_DCBEVT2 - CBC flag Digital compare event B2
 *                          - CDD_PWM_TZ_CBC_FLAG_CAPEVT  - CBC flag capture event
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivClearCycleByCycleTripZoneFlag(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(uint16, AUTOMATIC) TzCbcFlags);

/** \brief Clear the Trip Zone One Shot flag
 *
 * This function clears the specific One Shot (OST) Trip Zone flag.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzOSTFlags    OST flags to be cleared with valid values:
 *                          - CDD_PWM_TZ_OST_FLAG_OST1     - OST flag for OST1
 *                          - CDD_PWM_TZ_OST_FLAG_OST2     - OST flag for OST2
 *                          - CDD_PWM_TZ_OST_FLAG_OST3U    - OST flag for OST3U
 *                          - CDD_PWM_TZ_OST_FLAG_OST4     - OST flag for OST4
 *                          - CDD_PWM_TZ_OST_FLAG_OST5     - OST flag for OST5
 *                          - CDD_PWM_TZ_OST_FLAG_OST6     - OST flag for OST6
 *                          - CDD_PWM_TZ_OST_FLAG_DCAEVT1  - OST flag for Digital compare event A1
 *                          - CDD_PWM_TZ_OST_FLAG_DCBEVT1  - OST flag for Digital compare event B1
 *                          - CDD_PWM_TZ_OST_FLAG_CAPEVT   - OST flag capture event
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivClearOneShotTripZoneFlag(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                     VAR(uint16, AUTOMATIC) TzOSTFlags);

/** \brief Force Trip Zone events
 *
 * This function forces a Trip Zone event.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzForceEvent   Forced Trip Zone event with valid values:
 *                           - CDD_PWM_TZ_FORCE_EVENT_CBC     - Force Trip Zones Cycle By Cycle event
 *                           - CDD_PWM_TZ_FORCE_EVENT_OST     - Force Trip Zones One Shot Event
 *                           - CDD_PWM_TZ_FORCE_EVENT_DCAEVT1 - Force Digital Compare A Event 1
 *                           - CDD_PWM_TZ_FORCE_EVENT_DCAEVT2 - Force Digital Compare A Event 2
 *                           - CDD_PWM_TZ_FORCE_EVENT_DCBEVT1 - Force Digital Compare B Event 1
 *                           - CDD_PWM_TZ_FORCE_EVENT_DCBEVT2 - Force Digital Compare B Event 2
 *                           - CDD_PWM_TZ_FORCE_EVENT_CAPEVT  - Force Capture Event
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivForceTripZoneEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) TzForceEvent);

