TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Select TRIPOUT signals for the ePWM module
 *
 * This function selects the TRIPOUT signals for the ePWM module.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TzTripOut     Trip zone event to be selected with valid values:
 *                          - CDD_PWM_TZ_TRIPOUT_CBC     - CBC as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_OST     - OST as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_TZ[1-6] - TZx as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_DCAEVT1 - DCAEVT1 as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_DCAEVT2 - DCAEVT2 as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_DCBEVT1 - DCBEVT1 as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_DCBEVT2 - DCBEVT2 as TRIPOUT source
 *                          - CDD_PWM_TZ_TRIPOUT_CAPEVT  - Capture Event as TRIPOUT source
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureTripOutSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(Cdd_Pwm_SelectTripOutSourceType, AUTOMATIC) TzTripOut,
                                   VAR(boolean, AUTOMATIC) Select);

/*
 * Event Trigger related APIs
 */

/** \brief Return the interrupt status
 *
 * This function returns the ePWM interrupt status.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \note This function doesn't return the Trip Zone status.
 * \return Returns true if ePWM interrupt was generated, false if no interrupt was generated
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE) Cdd_Pwm_PrivGetEventTriggerInterruptStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enable Pre-interrupt count load
 *
 * This function enables the ePWM interrupt counter to be pre-interrupt loaded with a count value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \note This is valid only for advanced/expanded interrupt mode
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureInterruptEventCountInit(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(boolean, AUTOMATIC) Select);

/** \brief Force a software pre interrupt event counter load
 *
 * This function forces the ePWM interrupt counter to be loaded with the
 * contents set by Cdd_Pwm_SetPreInterruptEventCount().
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \note Make sure the EPWM_enablePreInterruptEventCountLoad() function is called before invoking this function.
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceInterruptEventCountInit(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Get the interrupt count
 *
 * This function returns the ePWM interrupt event count.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return The interrupt event counts that have occurred
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetInterruptEventCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Force ePWM interrupt
 *
 * This function forces an ePWM interrupt.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceEventTriggerInterrupt(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Sets the mixed event trigger interrupt source
 *
 * This function sets the ePWM interrupt source.
 *
 * \param[in] InstanceId          Numeric ID of the requested PWM instance
 * \param[in] EtMixSignal       The module for which trigger needs to be enabled
 *                              - CDD_PWM_ETMIX_INTERRUPT - Mixed ET Interrupt signal
 *                              - CDD_PWM_ETMIX_SOCA - Mixed ET SOCA signal
 *                              - CDD_PWM_ETMIX_SOCB - Mixed ET SOCB signal
 * \param[in] InterruptSource   The Mixed ET interrupt source
 *                              - CDD_PWM_ETMIX_TBCTR_ZERO - Time-base counter equal to zero
 *                              - CDD_PWM_ETMIX_TBCTR_PERIOD - Time-base counter equal to period
 *                              - CDD_PWM_ETMIX_TBCTR_U_CMPx - Where x is AU,BU,C or D
 *                                Time-base counter equal to CMPAU, CMPBU, CMPC or CMPD
 *                                (depending the value of x) when the timer is incrementing
 *                              - CDD_PWM_ETMIX_TBCTR_D_CMPx - Where x is AU,BU,C or D
 *                                Time-base counter equal to CMPAU, CMPBU, CMPC or CMPD
 *                                (depending the value of x) when the timer is decrementing
 *                              - CDD_PWM_ETMIX_DCAEVT1 - DCAEVT1 interrupt signal to trigger
 *                                mixed ET interrupt
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetMixEvtTriggerSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(Cdd_Pwm_EtMixSignalSelectType, AUTOMATIC) EtMixSignal,
                                   VAR(Cdd_Pwm_EvtMixTriggerSourceType, AUTOMATIC) InterruptSource);

