TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/*
 * Adc SOC configuration related APIs
 */

/** \brief Enable Adc SOC event
 *
 * This function enables the ePWM module to trigger an Adc SOC event.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureAdcTrigger(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType,
                                VAR(boolean, AUTOMATIC) Select);

/** \brief Sets the ePWM SOC source
 *
 * This function sets the ePWM Adc SOC source.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \param[in] SocSource     The SOC source
 *                          - CDD_PWM_SOC_DCXEVT1 - Event is based on DCxEVT1
 *                          - CDD_PWM_SOC_TBCTR_ZERO - Time-base counter equal to zero
 *                          - CDD_PWM_SOC_TBCTR_PERIOD - Time-base counter equal to period
 *                          - CDD_PWM_SOC_TBCTR_ETSOCAMIX - Time-base counter based on mixed events (ETSOCAMIX)
 *                          - CDD_PWM_SOC_TBCTR_U_CMPx - Where x is AU,BU,C or D
 *                            Time-base counter equal to CMPAU, CMPBU, CMPC or CMPD
 *                            (depending the value of x) when the timer is incrementing
 *                          - CDD_PWM_SOC_TBCTR_D_CMPx - Where x is AU,BU,C or D
 *                            Time-base counter equal to CMPAU, CMPBU, CMPC or CMPD
 *                            (depending the value of x) when the timer is decrementing
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetAdcTriggerSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType,
                                VAR(Cdd_Pwm_AdcStartOfConversionSourceType, AUTOMATIC) SocSource);

/** \brief Sets the ePWM SOC event counts
 *
 * This function sets the SOC event count that determines the number of
 * events that have to occur before an SOC is issued.
 *
 * \param[in] InstanceId        Numeric ID of the requested PWM instance
 * \param[in] AdcSocType        The Adc SOC type
 *                              - CDD_PWM_SOC_A - SOC A
 *                              - CDD_PWM_SOC_B - SOC B
 * \param[in] PreScaleCount     The event count number
 *                              - [1 - 15] - Generate SOC pulse every preScaleCount up to 15 events
 * \pre None
 * \post None
 * \note A PreScaleCount value of 0 disables the prescale
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetAdcTriggerEventPrescale(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType,
                                       VAR(uint16, AUTOMATIC) PreScaleCount);

/** \brief Return the SOC event status
 *
 * This function returns the ePWM SOC status.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \pre None
 * \post None
 * \return Returns true if the selected AdcSocType SOC was generated.
 *         Returns false if the selected AdcSocType SOC was not generated.
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE)
Cdd_Pwm_PrivGetAdcTriggerFlagStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                    VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType);

/** \brief Clear SOC flag
 *
 * This function clears the ePWM SOC flag.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivClearAdcTriggerFlag(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType);

/** \brief Enable Pre-SOC event count load
 *
 * This function enables the ePWM SOC event counter which is set by the
 * Cdd_Pwm_SetAdcTriggerEventCountInitValue() function to be loaded before
 * an SOC event.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \note This is valid only for advanced/expanded SOC mode
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureAdcTriggerEventCountInit(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                              VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType,
                                              VAR(boolean, AUTOMATIC) Select);

