TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Force a software pre SOC event counter load
 *
 * This function forces the ePWM SOC counter to be loaded with the
 * contents set by Cdd_Pwm_SetPreAdcStartOfConversionEventCount().
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 * \pre None
 * \post None
 * \note Make sure the EPWM_enableAdcTriggerEventCountInit() function is called before invoking this function.
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivForceAdcTriggerEventCountInit(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType);

/** \brief Set Adc Trigger count values
 *
 * This function sets the ePWM Adc Trigger count values.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \param[in] EventCount    The ePWM interrupt count value (maximum value is 15)
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetAdcTriggerEventCountInitValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType,
                                             VAR(uint16, AUTOMATIC) EventCount);

/** \brief Get the SOC event count
 *
 * This function returns the ePWM SOC event count.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \pre None
 * \post None
 * \return The SOC event counts that have occurred
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetAdcTriggerEventCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                    VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType);

/** \brief Force SOC event
 *
 * This function forces an ePWM SOC event.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] AdcSocType    The Adc SOC type
 *                          - CDD_PWM_SOC_A - SOC A
 *                          - CDD_PWM_SOC_B - SOC B
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivForceAdcTrigger(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                            VAR(Cdd_Pwm_AdcStartOfConversionType, AUTOMATIC) AdcSocType);

/*
 * Digital Compare module related APIs
 */

/** \brief Set the DC trip input
 *
 * This function sets the trip input to the Digital Compare (DC). For a given
 * dcType The function sets the tripSource to be the input to the DC.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TripInput     The trip source
 *                          - CDD_PWM_DC_TRIP_TRIPINx - Trip x, where x ranges from 1 to 15 excluding 13U
 *                          - CDD_PWM_DC_TRIP_COMBINATION - selects all the Trip signals whose input
 *                            is enabled by the Cdd_Pwm_EnableDigitalCompareTripCombinationInput() function
 * \param[in] DcType        The Digital Compare type
 *                          - CDD_PWM_DC_TYPE_DCAH - Digital Compare A High
 *                          - CDD_PWM_DC_TYPE_DCAL - Digital Compare A Low
 *                          - CDD_PWM_DC_TYPE_DCBH - Digital Compare B High
 *                          - CDD_PWM_DC_TYPE_DCBL - Digital Compare B Low
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectDigitalCompareTripInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(uint16, AUTOMATIC) TripInput,
                                          VAR(Cdd_Pwm_DigitalCompareType, AUTOMATIC) DcType);

/** \brief Enable DC filter blanking window
 *
 * This function enables the DC filter blanking window.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareBlankingWindow(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                  VAR(boolean, AUTOMATIC) Select);

/** \brief Enable Digital Compare Window inverse mode
 *
 * This function enables the Digital Compare Window inverse mode. This will
 * invert the blanking window.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareWindowInverseMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                     VAR(boolean, AUTOMATIC) Select);

/** \brief Set the Digital Compare filter blanking pulse
 *
 * This function sets the input pulse that starts the Digital Compare blanking
 * window.
 *
 * \param[in] InstanceId          Numeric ID of the requested PWM instance
 * \param[in] BlankingPulse     Pulse that starts blanking window
 *                              - CDD_PWM_DC_WINDOW_START_TBCTR_PERIOD - Time base counter equals period
 *                              - CDD_PWM_DC_WINDOW_START_TBCTR_ZERO - Time base counter equals zero
 *                              - CDD_PWM_DC_WINDOW_START_TBCTR_ZERO_PERIOD - Time base counter equals zero or period
 *                              - CDD_PWM_DC_WINDOW_START_BLANK_PULSE_MIX - Blanking pulse mix
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareBlankingEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                           Cdd_Pwm_DigitalCompareBlankingPulseType BlankingPulse);

/** \brief Set up the Digital Compare filter input
 *
 * This function sets the signal input source that will be filtered by the
 * Digital Compare module.
 *
 * \param[in] InstanceId          Numeric ID of the requested PWM instance
 * \param[in] FilterInput       Digital Compare signal source
 *                              - CDD_PWM_DC_WINDOW_SOURCE_DCAEVT1 - DC filter signal source is DCAEVT1
 *                              - CDD_PWM_DC_WINDOW_SOURCE_DCAEVT2 - DC filter signal source is DCAEVT2
 *                              - CDD_PWM_DC_WINDOW_SOURCE_DCBEVT1 - DC filter signal source is DCBEVT1
 *                              - CDD_PWM_DC_WINDOW_SOURCE_DCBEVT2 - DC filter signal source is DCBEVT2
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareFilterInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(Cdd_Pwm_DigitalCompareFilterInputType, AUTOMATIC) FilterInput);

