TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/*
 * DC Edge Filter
 */
/** \brief Enable Digital Compare Edge Filter
 *
 * This function enables the Digital Compare Edge filter to generate event
 * after configured number of edges.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select        Enable/Disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareEdgeFilter(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                              VAR(boolean, AUTOMATIC) Select);

/** \brief Set the Digital Compare Edge Filter Mode
 *
 * This function sets the Digital Compare Event filter mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] EdgeMode      Digital Compare Edge filter mode
 *                          - CDD_PWM_DC_EDGEFILT_MODE_RISING - DC edge filter mode is rising edge
 *                          - CDD_PWM_DC_EDGEFILT_MODE_FALLING - DC edge filter mode is falling edge
 *                          - CDD_PWM_DC_EDGEFILT_MODE_BOTH - DC edge filter mode is both edges
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareEdgeFilterMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(Cdd_Pwm_DigitalCompareEdgeFilterModeType, AUTOMATIC) EdgeMode);

/** \brief Set the Digital Compare Edge Filter Edge Count
 *
 * This function sets the Digital Compare Event filter Edge Count to generate events.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] EdgeCount     Digital Compare event filter count
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_0 - No edge is required to generate event
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_1 - 1 edge is required for event generation
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_2 - 2 edges are required for event generation
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_3U - 3U edges are required for event generation
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_4 - 4 edges are required for event generation
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_5 - 5 edges are required for event generation
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_6 - 6 edges are required for event generation
 *                          - CDD_PWM_DC_EDGEFILT_EDGECNT_7 - 7 edges are required for event generation
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareEdgeFilterEdgeCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                 VAR(uint16, AUTOMATIC) EdgeCount);

/** \brief Returns the Digital Compare Edge Filter Edge Count
 *
 * This function returns the configured Digital Compare Edge filter edge
 * count required to generate events. It can return values from 0-7.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return Returns the configured DigitalCompare Edge filter edge count
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetDigitalCompareEdgeFilterEdgeCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Returns the Digital Compare Edge filter captured edge count status
 *
 * This function returns the count of edges captured by Digital Compare Edge
 * filter. It can return values from 0-7.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return Returns the count of captured edges
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetDigitalCompareEdgeFilterEdgeStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Set up the Digital Compare filter window offset
 *
 * This function sets the offset between window start pulse and blanking
 * window in TBCLK count. The function takes a 16bit count value for the offset value.
 *
 * \param[in] InstanceId            Numeric ID of the requested PWM instance
 * \param[in] WindowOffsetCount     Blanking window offset length
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareWindowOffset(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(uint16, AUTOMATIC) WindowOffsetCount);

/** \brief Set up the Digital Compare filter window length
 *
 * This function sets up the Digital Compare filter blanking window length in
 * TBCLK count. The function takes a 16bit count value for the window length.
 *
 * \param[in] InstanceId            Numeric ID of the requested PWM instance
 * \param[in] WindowLengthCount     Blanking window length
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareWindowLength(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(uint16, AUTOMATIC) WindowLengthCount);

/** \brief Return DC filter blanking window offset count
 *
 * This function returns DC filter blanking window offset count.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetDigitalCompareBlankingWindowOffsetCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Return DC filter blanking window length count
 *
 * This function returns DC filter blanking window length count.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetDigitalCompareBlankingWindowLengthCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

