TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Set up the Digital Compare Event source
 *
 * This function sets up the Digital Compare module Event sources.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Digital Compare module
 *                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
 *                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
 * \param[in] DcEvent Digital Compare Event number
 *                    - CDD_PWM_DC_EVENT_1: Digital Compare Event number 1
 *                    - CDD_PWM_DC_EVENT_2: Digital Compare Event number 2
 * \param[in] DcEventSource Digital Compare Event source
 *                         - CDD_PWM_DC_EVENT_SOURCE_FILT_SIGNAL: signal source is filtered
 *                           \note The signal source for this option is DCxEVTy, where the
 *                                 value of x is dependent on OutputChannel and the value of y is
 *                                 dependent on DcEvent. Possible signal sources are DCAEVT1U,
 *                                 DCBEVT1U, DCAEVT2 or DCBEVT2 depending on the value of both
 *                                 OutputChannel and DcEvent.
 *                         - CDD_PWM_DC_EVENT_SOURCE_ORIG_SIGNAL: signal source is unfiltered
 *                           The signal source for this option is DCxEVTy.
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareEventSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                         VAR(Cdd_Pwm_DigitalCompareEventType, AUTOMATIC) DcEvent,
                                         VAR(Cdd_Pwm_DigitalCompareEventSourceType, AUTOMATIC) DcEventSource);

/** \brief Set up the Digital Compare input sync mode
 *
 * This function sets up the Digital Compare module Event sources.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Digital Compare module
 *                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
 *                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
 * \param[in] DcEvent Digital Compare Event number
 *                    - CDD_PWM_DC_EVENT_1: Digital Compare Event number 1
 *                    - CDD_PWM_DC_EVENT_2: Digital Compare Event number 2
 * \param[in] SyncMode Digital Compare Event sync mode
 *                     - CDD_PWM_DC_EVENT_INPUT_SYNCED: DC input signal is synced with TBCLK
 *                     - CDD_PWM_DC_EVENT_INPUT_NOT SYNCED: DC input signal is not synced with TBCLK
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareEventSyncMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                           VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                           VAR(Cdd_Pwm_DigitalCompareEventType, AUTOMATIC) DcEvent,
                                           VAR(Cdd_Pwm_DigitalCompareSyncModeType, AUTOMATIC) SyncMode);

/** \brief Enable Digital Compare to generate Start of Conversion
 *
 * This function enables the Digital Compare Event 1 to generate Start of Conversion.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Digital Compare module
 *                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
 *                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
 * \param[in] Select Enable/disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareAdcTrigger(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                              VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                              VAR(boolean, AUTOMATIC) Select);

/** \brief Enable Digital Compare to generate sync out pulse
 *
 * This function enables the Digital Compare Event 1 to generate sync out pulse.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Digital Compare module
 *                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
 *                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
 * \param[in] Select Enable/disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareSyncEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                             VAR(boolean, AUTOMATIC) Select);

/** \brief Set up the Digital Compare CBC latch mode
 *
 * This function sets up the Digital Compare CBC latch mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Digital Compare module
 *                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
 *                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
 * \param[in] DcEvent Digital Compare Event number
 *                    - CDD_PWM_DC_EVENT_1: Digital Compare Event number 1
 *                    - CDD_PWM_DC_EVENT_2: Digital Compare Event number 2
 * \param[in] LatchMode Digital Compare CBC latch mode
 *                      - CDD_PWM_DC_CBC_LATCH_DISABLED: DC cycle-by-cycle(CBC) latch is disabled
 *                      - CDD_PWM_DC_CBC_LATCH_ENABLED: DC cycle-by-cycle(CBC) latch is enabled
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareCBCLatchMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                          VAR(Cdd_Pwm_DigitalCompareEventType, AUTOMATIC) DcEvent,
                                          VAR(Cdd_Pwm_DigitalCompareCbcLatchModeType, AUTOMATIC) LatchMode);

/** \brief Sets the Digital Compare CBC latch clear event
*
* This function sets the Digital Compare CBC latch clear event.
*
* \param[in] InstanceId    Numeric ID of the requested PWM instance
* \param[in] OutputChannel Digital Compare module
*                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
*                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
* \param[in] DcEvent Digital Compare Event number
*                    - CDD_PWM_DC_EVENT_1: Digital Compare Event number 1
*                    - CDD_PWM_DC_EVENT_2: Digital Compare Event number 2
* \param[in] ClearEvent Digital Compare CBC latch clear event
*                       - CDD_PWM_DC_CBC_LATCH_CLR_CNTR_ZERO: DC CBC latch is cleared when counter is zero
*                       - CDD_PWM_DC_CBC_LATCH_CLR_ON_CNTR_PERIOD:
                                            DC CBC latch is cleared when counter is equal to period
*                       - CDD_PWM_DC_CBC_LATCH_CLR_ON_CNTR_ZERO_PERIOD:
                                            DC CBC latch is cleared when either counter is zero or equal to period
* \pre None
* \post None
* \return None
*
*********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectDigitalCompareCBCLatchClearEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                   VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                   VAR(Cdd_Pwm_DigitalCompareEventType, AUTOMATIC) DcEvent,
                                                   VAR(Cdd_Pwm_DigitalCompareCBCLatchClearEventType, AUTOMATIC)
                                                       ClearEvent);

/** \brief Gets the Digital Compare CBC latch status
 *
 * This function returns the Digital Compare module cycle-by-cycle(CBC) latch status.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Digital Compare module
 *                         - CDD_PWM_DC_MODULE_A: Digital Compare Module A
 *                         - CDD_PWM_DC_MODULE_B: Digital Compare Module B
 * \param[in] DcEvent Digital Compare Event number
 *                    - CDD_PWM_DC_EVENT_1: Digital Compare Event number 1
 *                    - CDD_PWM_DC_EVENT_2: Digital Compare Event number 2
 * \pre None
 * \post None
 * \return Digital Compare CBC latch status
 *         - true: CBC latch is enabled
 *         - false: CBC latch is disabled
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE)
Cdd_Pwm_PrivGetDigitalCompareCBCLatchStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                            VAR(Cdd_Pwm_DigitalCompareEventType, AUTOMATIC) DcEvent);

