TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/*
 * DC capture mode
 */
/** \brief Enables the Time Base Counter Capture controller
 *
 * This function enables the time Base Counter Capture.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Enable/disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareCounterCapture(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                  VAR(boolean, AUTOMATIC) Select);

/** \brief Set the Time Base Counter Capture mode
 *
 * This function sets the mode the Time Base Counter value is read from. If
 * EnableShadowMode is true, CPU reads of the DCCAP register will return the
 * shadow register contents. If EnableShadowMode is false, CPU reads of the
 * DCCAP register will return the active register contents.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] EnableShadowMode Shadow read mode flag
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDigitalCompareCounterShadowMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                               VAR(boolean, AUTOMATIC) EnableShadowMode);

/** \brief Return the DC Capture event status
 *
 * This function returns the DC capture event status.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return DC capture event status
 *         - true: A DC capture event has occurred
 *         - false: No DC Capture event has occurred
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE) Cdd_Pwm_PrivGetDigitalCompareCaptureStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Configures DC capture operating mode
 *
 * This function is used to configure the DC capture operating mode. If
 * DisableClearMode is false, the TBCNT value is captured in active register
 * on occurrence of DCEVTFILT event. The trip events are ignored until next
 * PRD or ZRO event re-triggers the capture mechanism.
 * If DisableClearMode is true, the TBCNT value is captured, CAPSTS flag is
 * set and further trips are ignored until CAPSTS bit is cleared.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] DisableClearMode Clear mode bit
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareCounterCaptureMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                      VAR(boolean, AUTOMATIC) DisableClearMode);

/** \brief Clears DC capture latched status flag
 *
 * This function is used to clear the CAPSTS (set) condition.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivClearDigitalCompareCaptureStatusFlag(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Return the DC Time Base Counter capture value
 *
 * This function returns the DC Time Base Counter capture value. The value
 * read is determined by the mode as set in the
 * Cdd_Pwm_SetTimeBaseCounterReadMode() function.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return DC Time Base Counter Capture count value
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetDigitalCompareCaptureCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enable DC TRIP combinational input
 *
 * This function enables the specified Trip input.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TripInput Trip number
 *                     - CDD_PWM_DC_COMBINATIONAL_TRIPINx, where x is 1U,2U,...12U,14U,15
 * \param[in] DcType Digital Compare module
 *                  - CDD_PWM_DC_TYPE_DCAH: Digital Compare A High
 *                  - CDD_PWM_DC_TYPE_DCAL: Digital Compare A Low
 *                  - CDD_PWM_DC_TYPE_DCBH: Digital Compare B High
 *                  - CDD_PWM_DC_TYPE_DCBL: Digital Compare B Low
 * \param[in] Select Enable/disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDigitalCompareTripCombinationInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                        VAR(uint16, AUTOMATIC) TripInput,
                                                        VAR(Cdd_Pwm_DigitalCompareType, AUTOMATIC) DcType,
                                                        VAR(boolean, AUTOMATIC) Select);
/*
 * Event capture mode
 */

/** \brief Enables the Capture event
 *
 * This function enables the CAPIN.sync on which the edge detection logic
 * is performed.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Enable/disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/

FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureCaptureInEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Polarity selection for capture gate input
 *
 * This function selects the input polarity for capture gate.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] PolaritySelect Polarity to be selected for CAPGATE
 *                          - CDD_PWM_CAPGATE_INPUT_ALWAYS_ON: always on
 *                          - CDD_PWM_CAPGATE_INPUT_ALWAYS_OFF: always off
 *                          - CDD_PWM_CAPGATE_INPUT_SYNC: CAPGATE.sync
 *                          - CDD_PWM_CAPGATE_INPUT_SYNC_INVERT: CAPGATE.sync inverted
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigCaptureGateInputPolarity(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                           VAR(Cdd_Pwm_SelectCaptureGateInputPolarityType, AUTOMATIC) PolaritySelect);

/** \brief Polarity selection for capture input
 *
 * This function selects the input polarity for capture.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] PolaritySelect Polarity to be selected for CAPIN
 *                          - CDD_PWM_CAPTURE_INPUT_CAPIN_SYNC: not inverted
 *                          - CDD_PWM_CAPTURE_INPUT_CAPIN_SYNC_INVERT: inverted
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivInvertCaptureInputPolarity(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(Cdd_Pwm_SelectCaptureInputPolarityType, AUTOMATIC) PolaritySelect);

/** \brief Enables independent pulse selection for Blanking and Capture Logic
 *
 * This function enables pulse selection determined by the CAPMIXSEL register.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Enable/disable selection
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureIndependentPulseLogic(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                           VAR(boolean, AUTOMATIC) Select);

/** \brief Capture event force load
 *
 * This function forces a load to occur on DCCAP.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceCaptureEventLoad(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

