TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Set the capture trip input
 *
 * This function sets the trip input to the Digital Compare (DC). For a given
 * dcType The function sets the tripSource to be the input to the DC.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TripInput Trip source
 *                     - CDD_PWM_DC_TRIP_TRIPINx: Trip x, where x ranges from 1 to 15 excluding 13U
 *                     - CDD_PWM_DC_TRIP_COMBINATION: selects all the Trip signals whose input
 *                                               is enabled by the Cdd_Pwm_EnableCaptureTripCombinationInput() function
 * \param[in] DcType Digital Compare type
 *                  - CDD_PWM_CAPTURE_GATE
 *                  - CDD_PWM_CAPTURE_INPUT
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectCaptureTripInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) TripInput,
                                   VAR(Cdd_Pwm_CaptureInputType, AUTOMATIC) DcType);

/** \brief Enable Capture TRIP combinational input
 *
 * This function enables the specified Trip input.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TripInput Trip number. Valid values:
 *                     - CDD_PWM_DC_COMBINATIONAL_TRIPINx, where x is 1U,2U,...12U,14U,15
 * \param[in] DcType Digital Compare module. Valid values:
 *                  - CDD_PWM_CAPTURE_GATE
 *                  - CDD_PWM_CAPTURE_INPUT
 * \param[in] Select Boolean to enable/disable the trip input
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureCaptureTripCombinationInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                 VAR(uint16, AUTOMATIC) TripInput,
                                                 VAR(Cdd_Pwm_CaptureInputType, AUTOMATIC) DcType,
                                                 VAR(boolean, AUTOMATIC) Select);
/** \brief Valley switching
*********************************************************************************************************************/

/** \brief Enable valley capture mode
 *
 * This function enables Valley Capture mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable valley capture mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureValleyCapture(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Start valley capture mode
 *
 * This function starts Valley Capture sequence.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre Make sure you invoke Cdd_Pwm_SetValleyTriggerSource with the trigger
 *      variable set to CDD_PWM_VALLEY_TRIGGER_EVENT_SOFTWARE before calling this
 *      function.
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivStartValleyCapture(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Set valley capture trigger
 *
 * This function sets the trigger value that initiates Valley Capture sequence.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Trigger Valley counter trigger
 * \pre None
 * \post Set the number of Trigger source events for starting and stopping the
 *       valley capture using Cdd_Pwm_SetValleyTriggerEdgeCounts().
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetValleyTriggerSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(Cdd_Pwm_ValleyTriggerSourceType, AUTOMATIC) Trigger);

/** \brief Set valley capture trigger source count
 *
 * This function sets the number of trigger events required to start and stop
 * the valley capture count.
 * Maximum values for both startCount and stopCount is 15 corresponding to the
 * 15th edge of the trigger event.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] StartCount Number of events to start the valley capture
 * \param[in] StopCount Number of events to stop the valley capture
 * \pre None
 * \post None
 * \note A startCount value of 0 prevents starting the valley counter.
 *       A stopCount value of 0 prevents the valley counter from stopping.
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetValleyTriggerEdgeCounts(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(uint16, AUTOMATIC) StartCount, VAR(uint16, AUTOMATIC) StopCount);

/** \brief Enable valley switching delay
 *
 * This function enables Valley switching delay.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable valley switching delay
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureValleyHwDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Set Valley delay values
 *
 * This function sets the Valley delay value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] DelayOffsetValue Software defined delay offset value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetValleySwDelayValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(uint16, AUTOMATIC) DelayOffsetValue);

