TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Set Valley delay mode
 *
 * This function sets the Valley delay mode values.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] DelayMode Valley delay mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetValleyDelayDivider(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(Cdd_Pwm_ValleyDelayModeType, AUTOMATIC) DelayMode);

/** \brief Get the valley edge status bit
 *
 * This function returns the status of the start or stop valley status
 * depending on the value of edge.
 * If a start or stop edge has occurred, the function returns true, if not it
 * returns false.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Edge Start or stop edge
 * \pre None
 * \post None
 * \return Returns true if the specified edge has occurred,
 *         Returns false if the specified edge has not occurred
 *
 *********************************************************************************************************************/
FUNC(boolean, CDD_PWM_CODE)
Cdd_Pwm_PrivGetValleyEdgeStatus(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                VAR(Cdd_Pwm_ValleyCounterEdgeType, AUTOMATIC) Edge);

/** \brief Get the Valley Counter value
 *
 * This function returns the valley time base count value which is captured
 * upon occurrence of the stop edge condition selected by
 * Cdd_Pwm_SetValleyTriggerSource() and by the stopCount variable of the
 * Cdd_Pwm_SetValleyTriggerEdgeCounts() function.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return Returns the valley base time count
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetValleyCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Get the Valley delay value
 *
 * This function returns the hardware valley delay count.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return Returns the valley delay count
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetValleyHwDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enable Global shadow load mode
 *
 * This function enables Global shadow to active load mode of registers.
 * The trigger source for loading shadow to active is determined by
 * Cdd_Pwm_SetGlobalLoadTrigger() function.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable global shadow load mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureGlobalLoad(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Set the Global shadow load trigger.
 *
 *   This function sets the global shadow load trigger
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] LoadTrigger is the pulse that causes global shadow load.
 *
 * This function sets the pulse that causes Global shadow to active load.
 * Valid values for the loadTrigger parameter are:
 *
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_ZERO              - load when counter is equal
 *                                                 to zero
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_PERIOD            - load when counter is equal
 *                                                 to period
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_ZERO_PERIOD       - load when counter is equal
 *                                                 to zero or period
 *   - CDD_PWM_GL_LOAD_PULSE_SYNC                    - load on sync event
 *   - CDD_PWM_GL_LOAD_PULSE_SYNC_OR_CNTR_ZERO      - load on sync event or when
 *                                                 counter is equal to zero
 *   - CDD_PWM_GL_LOAD_PULSE_SYNC_OR_CNTR_PERIOD    - load on sync event or when
 *                                                 counter is equal to period
 *   - CDD_PWM_GL_LOAD_PULSE_SYNC_CNTR_ZERO_PERIOD  - load on sync event or when
 *                                                 counter is equal to period
 *                                                 or zero
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_U_CMPC            - load when counter is equal
 *                                                 to CMPC while incrementing
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_D_CMPC            - load when counter is equal
 *                                                 to CMPC while decrementing
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_U_CMPD            - load when counter is equal
 *                                                 to CMPD while incrementing
 *   - CDD_PWM_GL_LOAD_PULSE_CNTR_D_CMPD            - load when counter is equal
 *                                                 to CMPD while decrementing
 *   - CDD_PWM_GL_LOAD_PULSE_GLOBAL_FORCE            - load on global force
 *
 * \pre None
 * \post None
 * \return None
 *
 ******************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetGlobalLoadTrigger(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                 VAR(Cdd_Pwm_GlobalLoadTriggerType, AUTOMATIC) LoadTrigger);

/** \brief Set the number of Global load pulse event counts
 *
 * This function sets the number of Global Load pulse events that have to
 * occurred before a global load pulse is issued. Valid values for
 * prescaleCount range from 0 to 7. 0 being no event (disables counter),
 * and 7 representing 7 events.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] PrescalePulseCount Pulse event counts
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetGlobalLoadEventPrescale(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(uint16, AUTOMATIC) PrescalePulseCount);

/** \brief Return the number of Global load pulse event counts
 *
 * This function returns the number of Global Load pulse events that have
 * occurred. These pulse events are set by the Cdd_Pwm_SetGlobalLoadTrigger()
 * function.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return Number of Global Load pulse events that have occurred
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE) Cdd_Pwm_PrivGetGlobalLoadEventCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enable One shot global shadow to active load
 *
 * This function enables a one time global shadow to active load. Register
 * load happens every time the event set by the
 * Cdd_Pwm_SetGlobalLoadTrigger() occurs.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable one shot global shadow to active load
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureGlobalLoadOneShotMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                           VAR(boolean, AUTOMATIC) Select);

/** \brief Enable One shot global shadow to active load
 *
 * This function enables a one time global shadow to active load. Register
 * load happens every time the event set by the
 * Cdd_Pwm_SetGlobalLoadTrigger() occurs.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivSetGlobalLoadOneShotLatch(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Force a software One shot global shadow to active load pulse
 *
 * This function forces a software a one time global shadow to active load
 * pulse.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceGlobalLoadOneShotEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enable a register to be loaded Globally
 *
 * This function enables the register specified by loadRegister to be globally
 * loaded.
 * Valid values for loadRegister are:
 *  - CDD_PWM_GL_REGISTER_TBPRD_TBPRDHR  - Register TBPRD:TBPRDHR
 *  - CDD_PWM_GL_REGISTER_CMPA_CMPAHR    - Register CMPA:CMPAHR
 *  - CDD_PWM_GL_REGISTER_CMPB_CMPBHR    - Register CMPB:CMPBHR
 *  - CDD_PWM_GL_REGISTER_CMPC           - Register CMPC
 *  - CDD_PWM_GL_REGISTER_CMPD           - Register CMPD
 *  - CDD_PWM_GL_REGISTER_DBRED_DBREDHR  - Register DBRED:DBREDHR
 *  - CDD_PWM_GL_REGISTER_DBFED_DBFEDHR  - Register DBFED:DBFEDHR
 *  - CDD_PWM_GL_REGISTER_DBCTL          - Register DBCTL
 *  - CDD_PWM_GL_REGISTER_AQCTLA_AQCTLA2 - Register AQCTLA/A2
 *  - CDD_PWM_GL_REGISTER_AQCTLB_AQCTLB2 - Register AQCTLB/B2
 *  - CDD_PWM_GL_REGISTER_AQCSFRC        - Register AQCSFRC
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] LoadRegister Register to be globally loaded
 * \param[in] Select Boolean to enable/disable global loading for the register
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureGlobalLoadRegisters(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(uint16, AUTOMATIC) LoadRegister, VAR(boolean, AUTOMATIC) Select);

