TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Lock registers
 *
 * This function locks the specified register group.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] RegisterGroup Register group to lock
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivLockRegisters(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                          VAR(Cdd_Pwm_LockRegisterGroupType, AUTOMATIC) RegisterGroup);

/** \brief XCMP related APIs
 */

/** \brief Enable ePWM XCMP mode
 *
 * This function enables the ePWM XCMP mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable XCMP mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureXCmpMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Enable ePWM XCMP Split
 *
 * This function splits 8 XCMP registers between CMPA and CMPB equally.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable XCMP split
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureSplitXCmp(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(boolean, AUTOMATIC) Select);

/** \brief Allocates XCMP registers to CMPA
 *
 * This function gives us choice to allocate range of XCMP registers to CMPA
 * Valid values for alloctype are:
 *    CDD_PWM_XCMP_NONE_CMPA      - Allocate 0 XCMP registers to CMPA
 *    CDD_PWM_XCMP_1_CMPA         - Allocate XCMP1 register to CMPA
 *    CDD_PWM_XCMP_2_CMPA         - Allocate XCMP1- XCMP2 registers to CMPA
 *    CDD_PWM_XCMP_3U_CMPA         - Allocate XCMP1- XCMP3U register to CMPA
 *    CDD_PWM_XCMP_4_CMPA         - Allocate XCMP1- XCMP4 registers to CMPA
 *    CDD_PWM_XCMP_5_CMPA         - Allocate XCMP1- XCMP5 register to CMPA
 *    CDD_PWM_XCMP_6_CMPA         - Allocate XCMP1- XCMP6 registers to CMPA
 *    CDD_PWM_XCMP_7_CMPA         - Allocate XCMP1- XCMP7 register to CMPA
 *    CDD_PWM_XCMP_8_CMPA         - Allocate XCMP1- XCMP8 register to CMPA
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Alloctype Range of XCMP registers to be allocated to CMPA
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivAllocAXCmp(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                       VAR(Cdd_Pwm_XCmp_AllocCmpAType, AUTOMATIC) Alloctype);

/** \brief Allocates XCMP registers to CMPB
 *
 * This function gives us choice to allocate range of XCMP registers to CMPB
 * Valid values for alloctype are:
 *    CDD_PWM_XCMP_1_CMPB         - Allocate XCMP5 register to CMPB
 *    CDD_PWM_XCMP_2_CMPB         - Allocate XCMP5- XCMP6 registers to CMPB
 *    CDD_PWM_XCMP_3U_CMPB         - Allocate XCMP5- XCMP7 register to CMPB
 *    CDD_PWM_XCMP_4_CMPB         - Allocate XCMP5- XCMP8 registers to CMPB
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Alloctype Range of XCMP registers to be allocated to CMPB
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivAllocBXCmp(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                       VAR(Cdd_Pwm_XCmp_AllocCmpBType, AUTOMATIC) Alloctype);

/** \brief Writes values to XCMP registers
 *
 * This function writes xcmpvalue to XCMP registers.
 * Valid values for XCmpReg are:
 *    CDD_PWM_XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
 *                          -XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
 *    CDD_PWM_XTBPRD_ACTIVE                               -XTBPRD_ACTIVE
 *    CDD_PWM_XTBPRD_SHADOW1                              -XTBPRD_SHADOW1
 *    CDD_PWM_XTBPRD_SHADOW2                              -XTBPRD_SHADOW2
 *    CDD_PWM_XTBPRD_SHADOW3                              -XTBPRD_SHADOW3
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] XCmpReg XCMP register offset
 * \param[in] XCmpValue Value to be written to XCMP registers
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpRegValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                            VAR(Cdd_Pwm_XCmpRegType, AUTOMATIC) XCmpReg, VAR(uint16, AUTOMATIC) XCmpValue);

/** \brief Writes values to CMPx Shadow registers
 *
 * This function writes cmpvalue to CMPC/D shadow registers.
 * Valid values for cmpReg are:
 *    CDD_PWM_CMPC_SHADOW1                             -CMPC_SHADOW1
 *    CDD_PWM_CMPD_SHADOW1                             -CMPD_SHADOW1
 *    CDD_PWM_CMPC_SHADOW2                             -CMPC_SHADOW2
 *    CDD_PWM_CMPD_SHADOW2                             -CMPD_SHADOW2
 *    CDD_PWM_CMPC_SHADOW3                             -CMPC_SHADOW3
 *    CDD_PWM_CMPD_SHADOW3                             -CMPD_SHADOW3
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] XCmpReg CMP register offset
 * \param[in] XCmpValue Value to be written to CMPC/D shadow registers
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpShadowRegValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(Cdd_Pwm_XCompareRegType, AUTOMATIC) XCmpReg, VAR(uint16, AUTOMATIC) XCmpValue);

/** \brief Writes values to XMINMAX registers
 *
 * This function writes xcmpvalue to XCMP registers.
 * Valid values for xminmaxReg are:
 *    CDD_PWM_XMIN_ACTIVE                              -XMIN_ACTIVE
 *    CDD_PWM_XMAX_ACTIVE                              -XMAX_ACTIVE
 *    CDD_PWM_XMIN_SHADOW1                             -XMIN_SHADOW1
 *    CDD_PWM_XMAX_SHADOW1                             -XMAX_SHADOW1
 *    CDD_PWM_XMIN_SHADOW2                             -XMIN_SHADOW2
 *    CDD_PWM_XMAX_SHADOW2                             -XMAX_SHADOW2
 *    CDD_PWM_XMIN_SHADOW3                             -XMIN_SHADOW3
 *    CDD_PWM_XMAX_SHADOW3                             -XMAX_SHADOW3
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] XMinMaxReg XCMP register offset
 * \param[in] XCmpValue Value to be written to XCMP registers
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXMinMaxRegValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                               VAR(Cdd_Pwm_XMinMaxRegType, AUTOMATIC) XMinMaxReg, VAR(uint16, AUTOMATIC) XCmpValue);

