TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Set up Action qualifier outputs based on XAQ registers
 *
 * This function sets up the Action Qualifier output on ePWM A or ePWMBU,
 * depending on the value of EpwmOutput, to a value specified by outPut based
 * on the input events - specified by event.
 * The following are valid values for the parameters.
 *   - CDD_pwmOutput
 *       - CDD_PWM_AQ_OUTPUT_A          - CDD_PWMxA output
 *       - CDD_PWM_AQ_OUTPUT_B          - CDD_PWMxB output
 *   -shadowset
 *       - CDD_PWM_XCMP_ACTIVE          - XCMP set is Active
 *       - CDD_PWM_XCMP_SHADOW1         - XCMP set is Shadow 1
 *       - CDD_PWM_XCMP_SHADOW2         - XCMP set is Shadow 2
 *       - CDD_PWM_XCMP_SHADOW3         - XCMP set is Shadow 3U
 *   - output
 *       - CDD_PWM_AQ_OUTPUT_NO_CHANGE  - No change in the output pins
 *       - CDD_PWM_AQ_OUTPUT_LOW        - Set output pins to low
 *       - CDD_PWM_AQ_OUTPUT_HIGH       - Set output pins to High
 *       - CDD_PWM_AQ_OUTPUT_TOGGLE     - Toggle the output pins
 *   - event
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP1        -Time base counter equals XCMP1
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP2        -Time base counter equals XCMP2
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP3U        -Time base counter equals XCMP3U
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP4        -Time base counter equals XCMP4
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP5        -Time base counter equals XCMP5
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP6        -Time base counter equals XCMP6
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP7        -Time base counter equals XCMP7
 *    CDD_PWM_AQ_OUTPUT_ON_TIMEBASE_XCMP8        -Time base counter equals XCMP8
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel ePWM pin type
 * \param[in] ShadowSet Shadow set number or active set
 * \param[in] Output Action Qualifier output
 * \param[in] Event Event that causes a change in output
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpActionQualifierAction(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(Cdd_Pwm_XCmpShadowSetType, AUTOMATIC) ShadowSet,
                                         VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                         VAR(Cdd_Pwm_ActionQualifierOutputType, AUTOMATIC) Output,
                                         VAR(Cdd_Pwm_XCmpAqOutputEventType, AUTOMATIC) Event);

/** \brief Enables ePWM XCMP reload event
 *
 * This function enables the ePWM XCMP reload event.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivEnableXLoad(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Forces register loading from shadow buffers
 *
 * This function is used for software force loading of the events in
 * global load mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceXLoad(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Selects the mode for the XCMP Shadow registers
 *
 * This function gives us choice to select the mode for XCMP shadow registers
 * Valid values for mode are:
 *    CDD_PWM_XCMP_LOADONCE         - Load mode is LOADONCE
 *    CDD_PWM_XCMP_LOADMULTIPLE     - Load mode is LOADMULTIPLE
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Mode Load mode selection for XCMP Shadow registers
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                            VAR(Cdd_Pwm_XCmpLoadModeType, AUTOMATIC) Mode);

/** \brief Selects the shadow register level allocation
 *
 * This function gives us choice to select the XCMP shadow registers level
 * Valid values for alloctype are:
 *    CDD_PWM_XCMP_SHADOWLEVEL_0 - Only Active reg is available
 *    CDD_PWM_XCMP_SHADOWLEVEL_1 - SHDW1 and Active regs
 *    CDD_PWM_XCMP_SHADOWLEVEL_2 - SHDW2U, SHDW1 and Active regs
 *    CDD_PWM_XCMP_SHADOWLEVEL_3U - SHDW3U, SHDW2U, SHDW1 and Active regs
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Level Shadow register level allocation options
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpShadowLevel(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                               VAR(Cdd_Pwm_XCmpShadowLevelType, AUTOMATIC) Level);

/** \brief Selects which shadow register set is in use
 *
 * This function gives us choice to select the shadow buffer to use currently.
 * Valid values for alloctype are:
 *    CDD_PWM_XCMP_XLOADCTL_SHDWBUFPTR_NULL         - No Shadow buffer is in use
 *    CDD_PWM_XCMP_XLOADCTL_SHDWBUFPTR_ONE          - Shadow buffer 1 is in use
 *    CDD_PWM_XCMP_XLOADCTL_SHDWBUFPTR_TWO          - Shadow buffer 2 is in use
 *    CDD_PWM_XCMP_XLOADCTL_SHDWBUFPTR_THREE        - Shadow buffer 3U is in use
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Ptr Current shadow buffer in use
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpShadowBufPtrLoadOnce(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(Cdd_Pwm_XCmpShadowBufPtrType, AUTOMATIC) Ptr);

