TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Chooses how many times Shadow buffer 2 or 3U is applied
 *
 * This function gives us choice to select how many times shadow buffer
 * 2 or 3U is applied. Max value is 7.
 * count = 0   - 1 time
 * count = 1   - 2 times .....
 * count = 7U    - 8 times
 * Valid values for bufferset are:
 *    CDD_PWM_XCMP_SHADOW2         - XCMP set is Shadow 2
 *    CDD_PWM_XCMP_SHADOW3         - XCMP set is Shadow 3U
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Bufferset Shadow set number
 * \param[in] Count Number of times Shadow Buffer 2 or 3U is applied
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetXCmpShadowRepeatBufxCount(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(Cdd_Pwm_XCmpShadowSetType, AUTOMATIC) Bufferset,
                                         VAR(uint32, AUTOMATIC) Count);

/** \brief Minimum Dead Band Module related APIs
 */

/** \brief Enable Minimum DeadBand module
 *
 * This function enables the Minimum DeadBand module.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDBCFG_ENABLEA   - CDD_PWM output A
 *      - CDD_PWM_MINDBCFG_ENABLEB   - CDD_PWM output B
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand Block to be enabled
 * \param[in] Select Boolean to enable/disable Minimum DeadBand module
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureMinimumDeadBand(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                     VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                     VAR(boolean, AUTOMATIC) Select);

/** \brief Invert the Minimum DeadBand Reference Signal
 *
 * This function configures the Minimum DeadBand module to invert reference
 * signal which is used in the Minimum DeadBand module.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - invert
 *      - CDD_PWM_MINDB_REF_SIG            - No inversion
 *      - CDD_PWM_MINDB_REF_SIG_INVERT     - Invert the signal
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand block to be configured
 * \param[in] Invert Specifies whether reference signal is to be inverted or not
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivInvertMinimumDeadBandSignal(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                        VAR(boolean, AUTOMATIC) Invert);

/** \brief Select signal for AND OR logic of Minimum DeadBand Module
 *
 * This function configures how the signal will be combined with the
 * PWM output. The signal can be inverted and ANDed with PWM output or it can
 * be ORed with the PWM output.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - logic
 *      - TRUE - CDD_PWM_MINDB_POLSEL_INVERT_LOGICAL_AND   - Invert and Logical AND
 *      - FALSE - CDD_PWM_MINDB_POLSEL_LOGICAL_OR           - Logical OR
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand block to be configured
 * \param[in] Logic Specifies how the signal will be combined
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectMinimumDeadBandAndOrLogic(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                            VAR(boolean, AUTOMATIC) Logic);

/** \brief Select Minimum DeadBand Blocking Signal
 *
 * This function configures the blocking signal for Minimum DeadBand module.
 * Either of the Block A or Block B signal can be selected as blocking signal.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - blockSrc
 *      - CDD_PWM_MINDB_BLOCKING_SIGNAL_BYPASS    - Block Source same
 *      - CDD_PWM_MINDB_BLOCKING_SIGNAL_SWAPBLOCK - Block Source different
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand block to be configured
 * \param[in] BlockingSignal Blocking signal to be used for a block
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectMinimumDeadBandBlockingSignal(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                VAR(boolean, AUTOMATIC) BlockingSignal);

/** \brief Select Minimum DeadBand Reference Signal
 *
 * This function selects the reference signal for Minimum DeadBand module.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - reference
 *      - CDD_PWM_MINDB_DEPWM             - Minimum Dead Band DE reference
 *      - CDD_PWM_MINDB_SEL_OUTXBAR_OUTy  - Output y from PWM Output XBAR
 *                                       ('y' can be from 1 to 15)
 *                                       ex. \b EPWM_MINDB_SEL_OUTXBAR_OUT1
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand block to be configured
 * \param[in] ReferenceSignal Reference signal to be selected
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectMinimumDeadBandReferenceSignal(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                 VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                 VAR(Cdd_Pwm_MindbReferenceSignalType, AUTOMATIC) ReferenceSignal);

/** \brief Get Minimum DeadBand Delay Value
 *
 * This function returns the delay value for the Minimum DeadBand module.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand block whose value is needed
 * \pre None
 * \post None
 * \return Delay value of the Minimum DeadBand module
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetMinDeadBandDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel);

