TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Set the Minimum DeadBand Delay Value
 *
 * This function configures the Minimum DeadBand delay value for the
 * specified block.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - delay: Minimum dead band delay on ePWM in terms of SYSCLK cycles
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Minimum DeadBand block to be configured
 * \param[in] Delay Delay value to be programmed for the Minimum DeadBand
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetMinDeadBandDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel, VAR(uint16, AUTOMATIC) Delay);

/** \brief Illegal Combo Logic
 *
 *********************************************************************************************************************/

/** \brief Enable Illegal Combo Logic
 *
 * This function enables the Illegal Combo Logic block.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Illegal Combo Logic block to be enabled
 * \param[in] Select Enable/disable selection for Illegal Combo Logic
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureIllegalComboLogic(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                       VAR(boolean, AUTOMATIC) Select);

/** \brief Select XBAR input for Illegal Combo Logic
 *
 * This function selects which Xbar signal feeds into the Illegal Combo Logic.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - xbarInput
 *      - CDD_PWM_MINDB_ICL_XBAR_OUTy - Output y from ICL XBAR
 *                                    ('y' can be from 0 to 15)
 *                                    ex. \b EPWM_MINDB_ICL_XBAR_OUT1
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Illegal Combo Logic block to be configured
 * \param[in] XbarInput Xbar signal to feed into the Illegal Combo Logic
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectXbarInput(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                            VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                            VAR(Cdd_Pwm_XbarInputType, AUTOMATIC) XbarInput);

/** \brief Force Decx values
 *
 * This function programs value in the Decx register fields of the Illegal
 * Combo Logic module.
 * Valid values for the input variables are:
 *  - block
 *      - CDD_PWM_MINDB_BLOCK_A    - CDD_PWM output A
 *      - CDD_PWM_MINDB_BLOCK_B    - CDD_PWM output B
 *  - decx
 *      - CDD_PWM_MINDB_ICL_LUT_DECx - 'x' can be from 0 to 7
 *  - force
 *      - value that can be forced can be either 0 or 1
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel Illegal Combo Logic block to be configured
 * \param[in] Decx Register to be programmed
 * \param[in] Force Value to be programmed in the register
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetLutDecX(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                       VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                       VAR(Cdd_Pwm_LutDecXType, AUTOMATIC) Decx, VAR(boolean, AUTOMATIC) Force);

/** \brief Diode Emulation logic related APIs
 *
 *********************************************************************************************************************/

/** \brief Enable ePWM diode emulation mode
 *
 * This function enables the ePWM diode emulation mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Enable/disable selection for diode emulation mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDiodeEmulationMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(boolean, AUTOMATIC) Select);

/** \brief Selects the mode for the Diode emulation mode
 *
 * This function gives us choice to select the mode for Diode emulation mode
 * Valid values for input variables are:
 * - mode
 *    CDD_PWM_DIODE_EMULATION_CBC         - Diode Emulation mode is Cycle by Cycle
 *    CDD_PWM_DIODE_EMULATION_OST         - Diode Emulation mode is One Shot
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Mode Load mode selection for Diode emulation mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDiodeEmulationMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(Cdd_Pwm_DiodeEmulationModeType, AUTOMATIC) Mode);

/** \brief Set ePWM diode emulation re-entry delay
 *
 * This function determines the blocking window after DEACTIVE flag is cleared
 * in which setting of DEACTIVE flag is prevented from being set.
 *
 * Valid values for input variables are:
 * - delay: Max value of delay is 256.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Delay Re-entry delay in terms of number of PWMSYNCOUT events
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDiodeEmulationReentryDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint8, AUTOMATIC) Delay);

/** \brief Set ePWM diode emulation trip source for TripL
 *
 * This function is used to configure the comparator whose
 * trip sources will be used.
 * Valid values for \e source are:
 *    CDD_PWM_DE_TRIPL_SRC_INPUTXBAR_OUT[0-16]     - INPUTXBAR out[0-16] signal
 *    CDD_PWM_DE_TRIPL_SRC_CLBINPUTXBAR_OUT[0-16]  - CLBINPUTXBAR out[0-16] signal
 *    CDD_PWM_DE_TRIPL_SRC_CMPSSTRIPL[1-11]        - CMPSSTRIPL[1-11] signal
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Source Trip source
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDiodeEmulationTripLowSources(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                  VAR(Cdd_Pwm_DETripLowSourceType, AUTOMATIC) Source);

/** \brief Set ePWM diode emulation trip source for TripH
 *
 * This function is used to configure the comparator whose
 * trip sources will be used.
 * Valid values for \e source are:
 *    CDD_PWM_DE_TRIPH_SRC_INPUTXBAR_OUT[0-16]     - INPUTXBAR out[0-16] signal
 *    CDD_PWM_DE_TRIPH_SRC_CLBINPUTXBAR_OUT[0-16]  - CLBINPUTXBAR out[0-16] signal
 *    CDD_PWM_DE_TRIPH_SRC_CMPSSTRIPH[1-11]        - CMPSSTRIPH[1-11] signal
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Source Trip source
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDiodeEmulationTripHighSources(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                   VAR(Cdd_Pwm_DETripHighSourceType, AUTOMATIC) Source);

/** \brief Selects ePWM diode emulation pwm signal
 *
 * This function is used to select the pwm signal in DE mode.
 * Valid values for channel are:
 *    CDD_PWM_DE_CHANNEL_A     - Diode emulation channel A
 *    CDD_PWM_DE_CHANNEL_B     - Diode emulation channel B
 *
 * Valid values for signal are:
 *    CDD_PWM_DE_SYNC_TRIPH_OR_TRIPL     - synchronized version of
 *                                TRIPH or TRIPL signal
 *    CDD_PWM_DE_SYNC_INV_TRIPH_OR_TRIPL - synchronized and inverted version
 *                                of TRIPH or TRIPL signal
 *    CDD_PWM_DE_LOW               - a constant low signal
 *    CDD_PWM_DE_HIGH              - a constant high signal
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel EPWM output channel
 * \param[in] DiodeEmuationsignal Signal selected by the TRIPSEL[A/B]
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectDiodeEmulationPwmSignal(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                          VAR(Cdd_Pwm_DiodeEmulationSignalType, AUTOMATIC) DiodeEmuationsignal);

/** \brief Selects between TRIPH and TRIPL for an epwm channel in DE mode
 *
 * This function is used to select between TRIPH and TRIPL
 * for a channel in DE mode.
 * Valid values for channel are:
 *    CDD_PWM_DE_CHANNEL_A     - Diode emulation channel A
 *    CDD_PWM_DE_CHANNEL_B     - Diode emulation channel B
 *
 * Valid values for signal are:
 *     0 for TRIPH
 *     1 for TRIPL
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel EPWM output channel
 * \param[in] TripSrc Diode Emulation trip sources signal
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSelectDiodeEmulationTripSignal(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                           VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                           VAR(Cdd_Pwm_DiodeEmulationTripSrcType, AUTOMATIC) TripSrc);

/** \brief PWMTRIP does not bypass the diode emulation logic
 *
 * This function is used to go through DEL.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivNoBypassDiodeEmulationLogic(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief PWMTRIP bypasses the diode emulation PWM generation logic
 *
 * This function is used to bypass DEL.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivbypassDiodeEmulationLogic(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

