TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Forces DEACTIVE flag to 1
 *
 * This function is used to force DEACTIVE flag to 1.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivForceDiodeEmulationActive(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Enables DE monitor control mode
 *
 * This function is used to enable the DE monitor counter function.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Enable/disable selection for DE monitor mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivConfigureDiodeEmulationMonitorModeControl(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                      VAR(boolean, AUTOMATIC) Select);

/** \brief Sets the DE monitor counter step size
 *
 * This function is used to set the DE monitor counter step size.
 * Valid values for \e direction are:
 *    CDD_PWM_DE_COUNT_UP     - Diode emulation count up step size
 *    CDD_PWM_DE_COUNT_DOWN   - Diode emulation count down step size.
 *
 *    Max value of stepsize is 256.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Direction Direction of the monitor counter counting either UP or DOWN
 * \param[in] StepSize Amount by which the counter increments or decrements at each step
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDiodeEmulationMonitorModeStep(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_DiodeEmulationDirectionType, AUTOMATIC) Direction,
                                             VAR(uint8, AUTOMATIC) StepSize);

/** \brief Sets the DE monitor counter threshold value
 *
 * This function is used to set the DE monitor counter threshold.
 *
 * Max value of threshold is 2^16.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Threshold Max value till which the monitor counter can count
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivSetDiodeEmulationMonitorCounterThreshold(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                     VAR(uint16, AUTOMATIC) Threshold);

/** \brief Clears DE mode active flag
 *
 * This function is used to clear the DE mode active flag
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE) Cdd_Pwm_PrivClearDiodeEmulationActiveFlag(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief HRPWM related APIs
 *
 *********************************************************************************************************************/

/** \brief Sets the consolidated phase shift value in high resolution mode
 *
 * This function sets the consolidated phase shift value, that is, both TBPHS
 * and TBPHSHR values are configured together.
 *
 * Call EPWM_enablePhaseShiftLoad & HRPWM_enableHRPhaseShiftLoad() functions
 * to enable loading of the phaseCount in high resolution mode.
 *
 * \b Note: phaseCount is a 24-bit value.
 * \b Note: For configuring TBPHS = 0x3C, TBPHSHR = 0x2;
 *          phaseCount = 0x3C02
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] PhaseCount Consolidated phase shift count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
#if (STD_ON == CDD_PWM_HRPWM_SUPPORTED)
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetPhaseShift(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint32, AUTOMATIC) PhaseCount);

/** \brief Sets only the high resolution phase shift value
 *
 * This function sets only the high resolution phase shift(TBPHSHR) value.
 * Call the HRPWM_enableHRPhaseShiftLoad() function to enable loading of
 * the hrPhaseCount.
 *
 * \b Note: hrPhaseCount is an 8-bit value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] HrPhaseCount High resolution phase shift count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetHiResPhaseShiftOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(uint16, AUTOMATIC) HrPhaseCount);

/** \brief Sets the consolidated period of time base counter used in HR mode
 *
 * This function sets the consolidated period of time base counter value
 * (TBPRD:TBPRDHR) required in high resolution mode.
 *
 * User should map the desired period or frequency of the waveform into
 * the correct periodCount.
 *
 * \b Note: periodCount is a 24 bit value.
 * \b Note: For configuring TBPRD = 0x3C, TBPRDHR = 0xA;
 *          periodCount = 0x3C0A
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] PeriodCount Consolidated period count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetTimeBasePeriod(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint32, AUTOMATIC) PeriodCount);

/** \brief Sets only the high resolution time base counter
 *
 * This function sets only the high resolution time base counter(TBPRDHR)
 * value.
 *
 * User should map the desired period or frequency of the waveform into
 * the correct hrPeriodCount.
 *
 * \b Note: hrPeriodCount is an 8-bit value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] HrPeriodCount High resolution period count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetHiResTimeBasePeriodOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(uint16, AUTOMATIC) HrPeriodCount);

