TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Gets the consolidated time base period count used in HR mode
 *
 * This function gets the consolidated time base period(TBPRD:TBPRDHR) value
 * used in high resolution mode.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return The consolidated time base period count value
 *
 *********************************************************************************************************************/
FUNC(uint32, CDD_PWM_CODE) Cdd_Pwm_PrivHrpwmGetTimeBasePeriod(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Gets only the high resolution time base period count
 *
 * This function gets only the high resolution time base period(TBPRDHR) value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \pre None
 * \post None
 * \return The high resolution time base period count value
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmGetHiResTimeBasePeriodOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId);

/** \brief Sets the high resolution edge controlled by MEP (Micro Edge Positioner)
 *
 * This function sets the edge of the PWM that is controlled by MEP (Micro
 * Edge Positioner). Valid values for the parameters are:
 *  - OutputChannel
 *      - HRPWM_CHANNEL_A  - HRPWM A
 *      - HRPWM_CHANNEL_B  - HRPWM B
 *  - MepEdgeMode
 *      - HRPWM_MEP_CTRL_DISABLE                 - HRPWM is disabled
 *      - HRPWM_MEP_CTRL_RISING_EDGE             - MEP (Micro Edge Positioner)
 *                                                 controls rising edge.
 *      - HRPWM_MEP_CTRL_FALLING_EDGE            - MEP (Micro Edge Positioner)
 *                                                 controls falling edge.
 *      - HRPWM_MEP_CTRL_RISING_AND_FALLING_EDGE - MEP (Micro Edge Positioner)
 *                                                 controls both edges.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel High resolution period module
 * \param[in] MepEdgeMode Edge of the PWM that is controlled by MEP
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetMepEdgeSelect(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                  VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                  VAR(Cdd_Pwm_HrpwmMepEdgeModeType, AUTOMATIC) MepEdgeMode);

/** \brief Sets the MEP (Micro Edge Positioner) control mode
 *
 * This function sets the mode (register type) the MEP (Micro Edge Positioner)
 * will control. Valid values for the parameters are:
 *  - OutputChannel
 *      - HRPWM_CHANNEL_A  - HRPWM A
 *      - HRPWM_CHANNEL_B  - HRPWM B
 *  - MepCtrlMode
 *      - HRPWM_MEP_DUTY_PERIOD_CTRL      - MEP (Micro Edge Positioner) is
 *                                          controlled by value of CMPAHR/
 *                                          CMPBHR(depending on the value of
 *                                          channel) or TBPRDHR.
 *      - HRPWM_MEP_PHASE_CTRL            - MEP (Micro Edge Positioner) is
 *                                          controlled by TBPHSHR.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel High resolution period module
 * \param[in] MepCtrlMode The MEP (Micro Edge Positioner) control mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetMepControlMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                   VAR(Cdd_Pwm_HrpwmMepCtrlModeType, AUTOMATIC) MepCtrlMode);

/** \brief Sets the high resolution comparator load mode
 *
 * This function sets the shadow load mode of the high resolution comparator.
 * The function sets the COMPA or COMPB register depending on the OutputChannel
 * variable.
 * Valid values for the parameters are:
 *  - OutputChannel
 *      - HRPWM_CHANNEL_A  - HRPWM A
 *      - HRPWM_CHANNEL_B  - HRPWM B
 *  - LoadEvent
 *      - HRPWM_LOAD_ON_CNTR_ZERO         - load when counter equals zero
 *      - HRPWM_LOAD_ON_CNTR_PERIOD       - load when counter equals period
 *      - HRPWM_LOAD_ON_CNTR_ZERO_PERIOD  - load when counter equals zero or
 *                                          period
 *      - HRPWM_LOAD_ON_CMPx_EQ           - load on translator event CMPA/B-3
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel High resolution period module
 * \param[in] LoadEvent The MEP (Micro Edge Positioner) control mode
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetCounterCompareShadowLoadEvent(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                  VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                  VAR(Cdd_Pwm_HrpwmLoadModeType, AUTOMATIC) LoadEvent);

/** \brief Sets the high resolution output swap mode
 *
 * This function sets the HRPWM output swap mode. If EnableOutputSwap is true,
 * ePWMxA signal appears on ePWMxB output and ePWMxB signal appears on ePWMxA
 * output. If it is false ePWMxA and ePWMxB outputs are unchanged.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] EnableOutputSwap The output swap flag
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetOutputSwapMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                   VAR(boolean, AUTOMATIC) EnableOutputSwap);

