TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets the high resolution output on ePWMxB
 *
 * This function sets the HRPWM output signal on ePWMxB. If OutputOnB is
 * HRPWM_OUTPUT_ON_B_INV_A, ePWMxB output is an inverted version of
 * ePWMxA. If OutputOnB is HRPWM_OUTPUT_ON_B_NORMAL, ePWMxB output is
 * ePWMxB.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputOnB The output signal on ePWMxB
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetChannelBOutputPath(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                       VAR(Cdd_Pwm_HrpwmChannelBOutputType, AUTOMATIC) OutputOnB);

/** \brief Enables MEP (Micro Edge Positioner) automatic scale mode
 *
 * This function enables the MEP (Micro Edge Positioner) to automatically
 * scale HRMSTEP.
 *
 * The SFO library will calculate required MEP steps per coarse steps and
 * feed it to HRMSTEP register. The MEP calibration module will use the value
 * in HRMSTEP to determine appropriate number of MEP steps represented by
 * fractional duty cycle.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable automatic conversion
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmConfigureAutoConversion(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(boolean, AUTOMATIC) Select);

/** \brief Enable high resolution period feature
 *
 * This function enables the high resolution period feature.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable period control
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmConfigurePeriodControl(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(boolean, AUTOMATIC) Select);

/** \brief Enable high resolution phase load
 *
 * This function enables loading of high resolution phase shift value which is
 * set by the function HRPWM_setPhaseShift().
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] Select Boolean to enable/disable phase shift load
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmConfigurePhaseShiftLoad(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                         VAR(boolean, AUTOMATIC) Select);

/** \brief Set high resolution PWMSYNC source
 *
 * This function sets the high resolution PWMSYNC pulse source.
 * Valid values for SyncPulseSource are:
 *  - HRPWM_PWMSYNC_SOURCE_PERIOD      - Counter equals Period.
 *  - HRPWM_PWMSYNC_SOURCE_ZERO        - Counter equals zero.
 *  - HRPWM_PWMSYNC_SOURCE_COMPC_UP    - Counter equals COMPC when
 *                                       counting up.
 *  - HRPWM_PWMSYNC_SOURCE_COMPC_DOWN  - Counter equals COMPC when
 *                                       counting down.
 *  - HRPWM_PWMSYNC_SOURCE_COMPD_UP    - Counter equals COMPD when
 *                                       counting up.
 *  - HRPWM_PWMSYNC_SOURCE_COMPD_DOWN  - Counter equals COMPD when
 *                                       counting down.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] SyncPulseSource The PWMSYNC source
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetSyncPulseSource(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                    VAR(Cdd_Pwm_HrpwmSyncPulseSourceType, AUTOMATIC) SyncPulseSource);

/** \brief Sets the Translator Remainder value
 *
 * This function sets the Translator Remainder value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] TrRemVal The translator remainder value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetTranslatorRemainder(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(uint16, AUTOMATIC) TrRemVal);

/** \brief Sets the consolidated counter compare values in HR mode
 *
 * This function sets the consolidated counter compare(CMPx:CMPxHR) value
 * required in high resolution mode for counter compare registers.
 * Valid values for OutputChannel are:
 *  - HRPWM_COUNTER_COMPARE_A - counter compare A.
 *  - HRPWM_COUNTER_COMPARE_B - counter compare B.
 *
 * \b Note: CompareCount is a 24 bit value.
 * \b Note: For configuring CMPA = 0xB4U, CMPAHR = 0x64; value of
 *          CompareCount = 0xB464
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel The Counter Compare module
 * \param[in] CompareCount The consolidated counter compare count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetCounterCompareValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                        VAR(uint32, AUTOMATIC) CompareCount);

/** \brief Sets only the high resolution counter compare value
 *
 * This function sets the high resolution counter compare value(CMPxHR) for
 * counter compare registers.
 * Valid values for OutputChannel are:
 *  - HRPWM_COUNTER_COMPARE_A - counter compare A.
 *  - HRPWM_COUNTER_COMPARE_B - counter compare B.
 *
 * \b Note: HrCompCount is an 8-bit value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel The Counter Compare module
 * \param[in] HrCompCount The high resolution counter compare count value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetHiResCounterCompareValueOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                                 VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel,
                                                 VAR(uint16, AUTOMATIC) HrCompCount);

/** \brief Gets the consolidated counter compare values
 *
 * This function gets the consolidated counter compare(CMPx:CMPxHR) value
 * used in high resolution for the counter compare module specified.
 * Valid values for OutputChannel are:
 *  - HRPWM_COUNTER_COMPARE_A - counter compare A.
 *  - HRPWM_COUNTER_COMPARE_B - counter compare B.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel The Counter Compare module value
 * \pre None
 * \post None
 * \return The consolidated counter compare value
 *
 *********************************************************************************************************************/
FUNC(uint32, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmGetCounterCompareValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                        VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel);

/** \brief Gets only the high resolution counter compare values
 *
 * This function gets only the high resolution counter compare(CMPxHR) value
 * for the counter compare module specified.
 * Valid values for OutputChannel are:
 *  - HRPWM_COUNTER_COMPARE_A - counter compare A.
 *  - HRPWM_COUNTER_COMPARE_B - counter compare B.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] OutputChannel The Counter Compare module value
 * \pre None
 * \post None
 * \return The high resolution counter compare value
 *
 *********************************************************************************************************************/
FUNC(uint16, CDD_PWM_CODE)
Cdd_Pwm_PrivGetHiResCounterCompareValueOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(Cdd_Pwm_OutputChannelType, AUTOMATIC) OutputChannel);

/** \brief Sets the consolidated RED count in high resolution mode
 *
 * This function sets the consolidated RED (Rising Edge Delay) count
 * (DBRED:DBREDHR) value used in high resolution mode. The value of
 * RedCount should be less than 0x200000.
 *
 * \b Note: RedCount is a 21 bit value.
 * \b Note: For configuring DBRED = 0x4U, DBREDHR = 0x1; value of
 *          RedCount = ((0x4 << 7) | 0x1) = 0x201
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] RedCount The high resolution RED count
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetRisingEdgeDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint32, AUTOMATIC) RedCount);

/** \brief Sets the high resolution RED count only
 *
 * This function sets only the high resolution RED (Rising Edge Delay)
 * count(DBREDHR) value.
 * The value of HrRedCount should be less than 128.
 *
 * \b Note: HrRedCount is a 7-bit value.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] HrRedCount The high resolution RED count
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetHiResRisingEdgeDelayOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(uint16, AUTOMATIC) HrRedCount);

