TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets the consolidated FED value in high resolution mode
 *
 * This function sets the consolidated FED (Falling Edge Delay) count
 * (DBFED: DBFEDHR) value used in high resolution mode. The value of FedCount
 * should be less than 0x200000.
 *
 * \b Note: FedCount is a 21 bit value.
 * \b Note: For configuring DBFED = 0x4U, DBFEDHR = 0x1; value of
 *          FedCount = ((0x4 << 7) | 0x1) = 0x201
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] FedCount The high resolution FED count
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetFallingEdgeDelay(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId, VAR(uint32, AUTOMATIC) FedCount);

/** \brief Sets high resolution FED count only.
 *
 * This function sets only the high resolution FED (Falling Edge Delay) count (DBFEDHR)value. The value of hrFedCount
 * should be less than 128.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] HrFedCount     The high resolution FED count. 7-bit value
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetHiResFallingEdgeDelayOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                              VAR(uint16, AUTOMATIC) HrFedCount);

/** \brief Set high resolution MEP (Micro Edge Positioner) step
 *
 * This function sets the high resolution MEP (Micro Edge Positioner) step
 * count. The maximum value for the MEP count step is 255.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] MepCount The high resolution MEP (Micro Edge Positioner) step count
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetMepStep(VAR(Cdd_Pwm_HrpwmCalInstanceType, AUTOMATIC) InstanceId, VAR(uint16, AUTOMATIC) MepCount);

/** \brief Set high resolution Dead Band MEP (Micro Edge Positioner) control
 *
 * This function sets the high resolution Dead Band edge that the MEP (Micro
 * Edge Positioner) controls. Valid values for MepDbEdge are:
 *   - HRPWM_DB_MEP_CTRL_DISABLE  - HRPWM is disabled
 *   - HRPWM_DB_MEP_CTRL_RED      - MEP (Micro Edge Positioner) controls
 *                                  Rising Edge Delay
 *   - HRPWM_DB_MEP_CTRL_FED      - MEP (Micro Edge Positioner) controls
 *                                  Falling Edge Delay
 *   - HRPWM_DB_MEP_CTRL_RED_FED  - MEP (Micro Edge Positioner) controls both
 *                                  Falling and Rising edge delays
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] MepDbEdge The high resolution MEP (Micro Edge Positioner) control edge
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetDeadbandMEPEdgeSelect(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(Cdd_Pwm_HrpwmMepDeadBandEdgeModeType, AUTOMATIC) MepDbEdge);

/** \brief Set the high resolution Dead Band RED load mode
 *
 * This function sets the high resolution Rising Edge Delay(RED)Dead Band
 * count load mode.
 * Valid values for LoadEvent are:
 *   - HRPWM_LOAD_ON_CNTR_ZERO        - load when counter equals zero
 *   - HRPWM_LOAD_ON_CNTR_PERIOD      - load when counter equals period
 *   - HRPWM_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals zero
 *                                       or period
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] LoadEvent The shadow to active load event
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetRisingEdgeDelayLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                            VAR(Cdd_Pwm_HrpwmLoadModeType, AUTOMATIC) LoadEvent);

/** \brief Set the high resolution Dead Band FED load mode
 *
 * This function sets the high resolution Falling Edge Delay(FED) Dead Band
 * count load mode.
 * Valid values for LoadEvent are:
 *   - HRPWM_LOAD_ON_CNTR_ZERO        - load when counter equals zero
 *   - HRPWM_LOAD_ON_CNTR_PERIOD      - load when counter equals period
 *   - HRPWM_LOAD_ON_CNTR_ZERO_PERIOD - load when counter equals zero
 *                                       or period
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] LoadEvent The shadow to active load event
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetFallingEdgeDelayLoadMode(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                             VAR(Cdd_Pwm_HrpwmLoadModeType, AUTOMATIC) LoadEvent);

/** \brief Lock HRPWM registers
 *
 * This function locks the specified HRPWM register group.
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] RegisterGroup The register group to lock
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmLockRegisters(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                               VAR(Cdd_Pwm_HrpwmLockRegisterGroupType, AUTOMATIC) RegisterGroup);

/** \brief Sets the consolidated XCMP values in HR mode
 *
 * This function sets the consolidated counter compare(XCMPx:XCMPxHR) value
 * required in high resolution mode for XCMP registers.
 * Valid values for XCmpReg are:
 *    EPWM_XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
 *                          -XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
 *    EPWM_XTBPRD_ACTIVE                               -XTBPRD_ACTIVE
 *    EPWM_XTBPRD_SHADOW1                              -XTBPRD_SHADOW1
 *    EPWM_XTBPRD_SHADOW2                              -XTBPRD_SHADOW2
 *    EPWM_XTBPRD_SHADOW3                              -XTBPRD_SHADOW3
 *
 * \b Note: For configuring XCMPx = 0x3E8, XCMPxHR = 0x64; value of
 *          XCmpValue = 0x03E80064
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] XCmpReg The XCMP register offset
 * \param[in] XCmpValue The consolidated value to be written to XCMP registers
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetXCmpRegValue(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                 VAR(Cdd_Pwm_XCmpRegType, AUTOMATIC) XCmpReg, VAR(uint32, AUTOMATIC) XCmpValue);

