TexasInstruments/f29h85x-mcal/drivers/Cdd_Pwm/include/Cdd_Pwm_Priv.h
/** \brief Sets only the high resolution XCMP value
 *
 * This function sets the high resolution counter compare value(XCMPx_HR) for
 * XCMP registers.
 * Valid values for XCmpReg are:
 *    EPWM_XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
 *                          -XCMP[1-8]_[ACTIVE/SHADOW1/SHADOW2/SHADOW3]
 *    EPWM_XTBPRD_ACTIVE                               -XTBPRD_ACTIVE
 *    EPWM_XTBPRD_SHADOW1                              -XTBPRD_SHADOW1
 *    EPWM_XTBPRD_SHADOW2                              -XTBPRD_SHADOW2
 *    EPWM_XTBPRD_SHADOW3                              -XTBPRD_SHADOW3
 *
 * \param[in] InstanceId    Numeric ID of the requested PWM instance
 * \param[in] XCmpReg The XCMP register offset
 * \param[in] HrXCmpValue The HR value to be written to XCMP registers
 * \pre None
 * \post None
 * \return None
 *
 *********************************************************************************************************************/
FUNC(void, CDD_PWM_CODE)
Cdd_Pwm_PrivHrpwmSetHiResXCmpRegValueOnly(VAR(Cdd_Pwm_InstanceType, AUTOMATIC) InstanceId,
                                          VAR(Cdd_Pwm_XCmpRegType, AUTOMATIC) XCmpReg,
                                          VAR(uint16, AUTOMATIC) HrXCmpValue);

/** \brief SFO V8 Calibration Function
 *
 * This function performs calibration for the SFO.
 *
 * \param[in] Cdd_Pwm_HrpwmCalId    Numeric ID of the requested HRPWM CAL instance
 * \pre None
 * \post None
 * \return Calibration status
 *
 *********************************************************************************************************************/
FUNC(Cdd_Pwm_SfoStatusType, CDD_PWM_CODE) Cdd_Pwm_PrivSfo(Cdd_Pwm_HrpwmCalInstanceType Cdd_Pwm_HrpwmCalId);

#endif
#endif

/*********************************************************************************************************************
 *  Exported Inline Function Definitions and Function-Like Macros
 *********************************************************************************************************************/

#ifdef __cplusplus
}
#endif

#endif /* CDD_PWM_PRIV_H*/
/*********************************************************************************************************************
 *  End of File: Cdd_Pwm_Priv.h
 *********************************************************************************************************************/
